{
  "file_description": "General rules and mechanics governing the use of the Force, Force Points, the Dark Side, and the acquisition and use of Force Powers in Star Wars Saga Edition.",
  "source_book_reference": "CR",
  "page_reference_general": "91-95",
  "the_force_overview": {
    "general_principles": "The Force is an energy field generated by all living things, binding the galaxy together. Some individuals, known as Force-sensitives, can learn to feel and manipulate this energy.",
    "using_the_force_skill": "The Use the Force skill (key ability: Charisma) is the primary means by which characters interact with the Force, activating powers, sensing disturbances, and performing other Force-related actions.",
    "force_abilities_categories": "Ways to use the Force include Force powers, Force talents, Force techniques, and Force secrets, each with varying requirements and effects.",
    "force_sensitivity_feat_requirement": "A character must possess the Force Sensitivity feat to be trained in the Use the Force skill and to utilize most Force powers and abilities."
  },
  "force_points": {
    "description": "Force Points represent a character's connection to the Force and their ability to call upon it for extraordinary efforts.",
    "gaining_force_points": [
      "Characters start with 5 Force Points at 1st level.",
      "Characters gain an additional Force Point each time they gain a new character level (as per Table 3-1: Experience and Level-Dependent Benefits, CRB p.37).",
      "The Force Boon feat grants an additional 3 Force Points each time it is taken."
    ],
    "using_force_points": [
      {"use": "Add to d20 roll result","details": "Spend 1 Force Point to roll 1d6 (or more dice at higher levels, see Table 7-1: Force Points, CRB p.112) and add the result to any d20 roll just made. Can be declared after the roll but before the outcome is revealed."},
      {"use": "Activate certain Force powers, talents, techniques, or secrets","details": "Some abilities require spending a Force Point as part of their activation cost."},
      {"use": "Recover one spent Force power","details": "Spend 1 Force Point as a reaction to immediately regain one spent Force power (see Regaining Spent Force Powers, CRB p.94)."},
      {"use": "Avoid death","details": "If reduced to 0 HP and would die, spend 1 Force Point to remain unconscious at 0 HP but stable."},
      {"use": "Lower Dark Side Score","details": "Spend 1 Force Point when atoning to lower Dark Side Score by 1 (see Atoning, CRB p.94)."}
    ],
    "regaining_force_points": "All spent Force Points are regained at the end of an adventure. The Gamemaster may also grant a character a Force Point for achieving a significant personal or story milestone, or for completing a particularly difficult task (this award typically occurs at the end of the relevant encounter or scene, not during it).",
    "force_point_limit_per_round": "A character can spend only 1 Force Point per round, unless a specific ability (such as a talent or spending a Destiny Point) states otherwise.",
    "source_page_reference": "CR 15, 37, 92-93, 112"
  },
  "the_dark_side": {
    "description": "The dark side offers a quicker, easier path to power, but it corrupts and ultimately consumes those who embrace it.",
    "dark_side_score_dss": {
      "tracking": "Characters track their Dark Side Score (DSS), which starts at 0.",
      "gaining_dark_side_points": [
        "Knowingly performing an evil act that causes harm to another (e.g., murder, torture, betrayal for personal gain).",
        "Using a Force power with the [dark side] descriptor.",
        "Using a talent, technique, or secret that explicitly states it increases the Dark Side Score."
      ],
      "immediate_effect_of_gaining_dss_point": "Regain all spent Force Points and move +1 step up the condition track."
    },
    "consequences_of_dark_side_score": [
      {"condition": "DSS equals Wisdom score","effect": "Character becomes an agent of the dark side, treating NPCs as hostile and PCs as unfriendly by default. Must make a DC 20 Will save to perform any action aiding another if it doesn't directly benefit self or the dark side."},
      {"condition": "DSS equals Constitution score","effect": "Character becomes wholly consumed by the dark side and is lost as a playable character (becomes an NPC under GM control)."}
    ],
    "atoning_for_dark_side_points": {
      "process": "Character must consciously choose to turn from the dark side and perform acts of good or self-sacrifice over a period of time. At the end of an adventure where such acts occur, can spend a Force Point to reduce DSS by 1. GM determines when atonement is complete.",
      "source_page_reference": "CR 94"
    },
    "dramatic_heroism": {
      "description": "Performing an act of dramatic heroism (risking self for others or a noble cause without expectation of reward) can sometimes allow a character to avoid gaining a Dark Side Point for an otherwise dark act necessary to achieve the heroic goal, at GM discretion.",
      "source_page_reference": "CR 94"
    },
    "source_page_reference": "CR 93-94"
  },
  "force_powers_general_rules": {
    "description": "Force powers are specific applications of the Force, categorized by their effects and how they are learned and used.",
    "learning_powers": "Typically learned by taking the Force Training feat, which grants a number of powers equal to 1 + Wisdom modifier.",
    "selecting_powers": "When selecting powers, a character chooses from the available list in the Core Rulebook or other sourcebooks, subject to prerequisites.",
    "force_power_suite": "A character has a suite of Force powers they can use. Once a power from the suite is used, it is considered 'spent' and cannot be used again until regained.",
    "using_powers": "Activating a Force power usually requires a Use the Force check against a DC specified by the power or situation. The time required (swift, standard, full-round, reaction) is listed in the power's description.",
    "regaining_spent_powers": [
      {"method": "Rest after combat","details": "When combat is over and you have a chance to rest for 1 minute, you regain all of your spent Force powers."},
      {"method": "Natural 20 on Use the Force check","details": "If you roll a natural 20 on a Use the Force check, you regain all spent Force powers at the end of your turn."},
      {"method": "Spending a Force Point","details": "You can spend a Force Point as a reaction and immediately regain one spent Force power."},
      {"method": "Unique abilities","details": "Some unique abilities (such as the Force Focus talent) allow you to regain spent Force powers in other ways."}
    ],
    "descriptors": {
      "introduction": "Force powers often have descriptors indicating their nature or alignment.",
      "light_side": "Powers aligned with the light side. Using them typically has no negative consequences. Using a [light side] power does not reduce Dark Side Score.",
      "dark_side": "Powers drawing on the dark side. Using a power with the [dark side] descriptor increases the user's Dark Side Score by 1.",
      "mind_affecting": "These powers affect the minds of targets. Droids and creatures immune to mind-affecting effects are typically immune.",
      "telekinetic": "These powers involve moving objects or creatures with the mind."
    },
    "source_page_reference": "CR 94-95"
  }
}