{
  "last_modified": "2025-06-04T10:20:54",
  "prestige_classes_rules_data": {
    "errata_applied": [
      "Corrected 'prestige_class_game_rules/defense_bonuses' to accurately reflect that class defense bonuses do not stack, aligning with general game rules (CRB p.37).",
      "Updated 'prestige_class_overview/entry_requirements' to include 'minimum base attack bonus' as a common prerequisite, aligning with CRB p.205.",
      "Added 'prestige_class_overview/in_game_requirements_note' to cover non-statistical prerequisites, based on CRB p.205.",
      "Replaced 'table_12_1_prestige_class_level_progression_summary' with 'prestige_class_force_point_progression' for improved accuracy regarding how general level benefits (feats, ability increases) are gained versus prestige class specific Force Point progression (CRB p.206)."
    ],
    "file_description": "General rules and mechanics for Prestige Classes in Star Wars Saga Edition.",
    "page_reference_general": "205-206",
    "prestige_class_force_point_progression": {
      "description": "Details the formula for Force Points gained at each level of a prestige class. General level-dependent benefits such as feats and ability score increases are determined by total character level as per Table 3-1 (CRB p.38). BAB, Defense Bonuses, Talents, and Special Abilities are specific to each prestige class and detailed in their individual entries.",
      "source_page_reference": "CR 206 (and individual PrC entries)",
      "force_points_gained_formula": "6 + floor(character_level / 2)",
      "notes": "This formula applies each time a character gains a level in any prestige class. Force Points from previous levels are lost."
    },
    "prestige_class_game_rules": {
      "hit_points": "A prestige class grants Hit Points per level as specified in its description (e.g., 1d8, 1d10, 1d12) + Constitution modifier.",
      "force_points": "A prestige class grants Force Points equal to 6 + one-half character level (rounded down) each time a new level in the prestige class is gained.",
      "defense_bonuses": "A prestige class grants class defense bonuses as shown on its specific advancement table. As with all class bonuses to defenses, these do not stack with class defense bonuses from other classes (heroic or prestige); for each defense score (Reflex, Fortitude, Will), the character applies only the highest class bonus granted by any of their classes.",
      "base_attack_bonus_bab": "A prestige class's BAB progression is listed in its advancement table and adds to the character's total BAB from all classes.",
      "talents": "Prestige classes grant new talent choices at specific levels, drawn from unique talent trees associated with that class or sometimes from existing heroic class talent trees.",
      "special_abilities": "Prestige classes often grant unique special abilities as the character advances in that class."
    },
    "prestige_class_overview": {
      "description": "Prestige classes offer characters a way to become truly exceptional, reflecting specialized training, unique talents, or a focused path. They build upon the foundation of heroic classes and allow for further character customization and power.",
      "entry_requirements": "To take a level in a prestige class, a character must first meet all of its prerequisites. Common prerequisites include a minimum character level (often 7th), a minimum base attack bonus, specific trained skills, feats, talents, or other special conditions outlined in the prestige class description.",
      "advancement": "Levels in prestige classes are taken instead of levels in heroic classes. A character can have levels in multiple prestige classes, provided they meet the prerequisites for each.",
      "in_game_requirements_note": "Beyond meeting statistical prerequisites, entry into a prestige class often requires in-character actions or achievements, such as completing special training, undertaking a specific quest, gaining acceptance into an organization, or other narrative elements as determined by the Gamemaster."
    },
    "rules_keywords": [
      "Prestige Classes",
      "Saga Edition Character Advancement",
      "Prestige Class Rules",
      "Prestige Class Prerequisites",
      "Prestige Class Benefits"
    ],
    "source_book_reference": "CR"
  }
}