[
  {
    "action": "update",
    "target_file_key": "skills",
    "identifier": { "id": "acrobatics" },
    "payload": [
      {
        "op": "replace",
        "path": "/common_uses/4/description",
        "value": "You can reduce the damage you take from a fall with a successful DC 15 Acrobatics check. If your check result beats the DC by 10 or more, you take only one-quarter damage. If it beats the DC by 20 or more, you take no damage. Errata (CRB p.291 for CRB p.255): If the check succeeds and you take no damage from the fall, you land on your feet. If you fall from a height of greater than 60 meters, treat the fall as being only 60 meters for the purposes of reducing falling distance with this skill. If struck by a falling object, a successful check reduces damage by half. [Sourced from CRB p.64, Errata p.291]"
      }
    ]
  },
  {
    "action": "update",
    "target_file_key": "skills",
    "identifier": { "id": "jump" },
    "payload": [
      {
        "op": "replace",
        "path": "/common_uses/2/description",
        "value": "If you intentionally jump down from a height, you can attempt a DC 15 Jump check to take falling damage as if you had dropped 3 meters (2 squares) fewer than you actually did. For every 10 points by which you beat the DC, you can subtract an additional 3 meters from the fall when determining damage. Errata (CRB p.291 for CRB p.255): If the check succeeds and you take no damage from the fall (because the effective fall distance was reduced to 0 or less through successive reductions), you land on your feet. If you fall from a height of greater than 60 meters, treat the fall as being only 60 meters for the purposes of reducing falling distance with this skill. [Sourced from CRB p.69, Errata p.291]"
      }
    ]
  },
  {
    "action": "update",
    "target_file_key": "skills",
    "identifier": { "id": "mechanics" },
    "payload": [
      {
        "op": "replace",
        "path": "/common_uses/0/description",
        "value": "Disarm a security device, defeat a lock, or disable/rig a mechanical trap. Requires appropriate tools (e.g., security kit for locks/electronic traps, tool kit for mechanical traps). Disabling a simple device takes 1 minute. Complex devices might take longer. The DC is set by the device or trap. If disabling a trap and the check fails by 10 or more, you trigger it. If attempting to rig a device to fail and the check fails by 5 or more, you believe it's rigged but it isn't. [Sourced from CRB p.70, p.253]"
      },
      {
        "op": "replace",
        "path": "/common_uses/3/description",
        "value": "Disarm an explosive set to go off. Requires a security kit or tool kit. The DC is usually 15 unless the individual who set the explosive chose a higher DC (see Set Detonator). If you fail the check by 5 or more, the explosive detonates. This takes a full-round action. [Sourced from CRB p.70-71]"
      }
    ]
  },
  {
    "action": "update",
    "target_file_key": "skills",
    "identifier": { "id": "treat_injury" },
    "payload": [
      {
        "op": "replace",
        "path": "/common_uses/5/description",
        "value": "You can tend to a character afflicted by a disease. This takes 10 minutes of work. If your Treat Injury check against the DC of the disease is successful, the target character automatically recovers from the disease and no longer suffers its ill effects. You can make one attempt to treat a specific disease in a given character per day. Requires a medical kit or medpac. [Sourced from CRB p.74]"
      },
      {
        "op": "replace",
        "path": "/common_uses/6/description",
        "value": "You can tend to a character afflicted by a poison. This takes 1 minute of work. If your Treat Injury check against the DC of the poison is successful, the target character no longer suffers any ill effects from the poison (though Hit Point damage already dealt by the poison is not restored). You can make one attempt to treat a specific poison in a given character per minute of treatment. Requires a medical kit or medpac. [Sourced from CRB p.74]"
      },
      {
        "op": "add",
        "path": "/common_uses/-",
        "value": {
          "use_name": "Treat Radiation",
          "trained_only": true,
          "armor_check_penalty_for_this_use": false,
          "description": "You can treat a character suffering from radiation poisoning. This takes 8 hours of work and requires a medical kit or medpac. If your Treat Injury check against the DC of the radiation (e.g., Moderate Radiation DC 20, Extreme Radiation DC 30, as per CRB p.255, Table 14-3) is successful, the patient is cured, and any persistent conditions from the radiation are removed. You can treat one untrained character or up to six trained characters simultaneously. You can use this application on yourself, but you take a -5 penalty on the check. [Sourced from CRB p.76, p.255]",
          "dc": {"type": "variable", "determination_formula": "Radiation's DC (see CRB p.255, Table 14-3)"},
          "action_cost": "8 hours"
        }
      }
    ]
  },
  {
    "action": "update",
    "target_file_key": "skills",
    "is_single_object": false,
    "payload_is_list_root": true,
    "payload": [
      {
        "op": "add",
        "path": "/skills_data/errata_applied",
        "value": [
          "Acrobatics (Reduce Falling Damage): Updated to include CRB Errata p.291 (for CRB p.255) regarding landing on feet and 60m limit.",
          "Jump (Reduce Falling Damage/Jump Down Safely): Updated to include CRB Errata p.291 (for CRB p.255) regarding landing on feet and 60m limit.",
          "Mechanics (Disable Device/Arm-Disarm Explosives): Descriptions refined to better align with CRB p.70 & p.253 regarding consequences of failure.",
          "Treat Injury (Treat Disease/Poison): Clarified DC reference to 'DC of the disease/poison'. Added 'Treat Radiation' application based on CRB p.74 & p.255."
        ]
      }
    ]
  }
]
