[
{"target_file_key":"class_rules","action":"update","identifier":{"name":"Class System Core Rules","source_book":"CR"},"payload":{"level_dependent_benefits_heroic":{"description":"Summarizes additional benefits gained as heroic characters advance in level. Some benefits are based on total Character Level, while others (like talents from heroic classes) are based on individual Class Level.","table_reference_crb":"Table 3-1: Experience and Level-Dependent Benefits (CRB p.37)","experience_points_xp":"XP determines overall character level.","feats_progression_by_character_level":{"description":"Heroic characters gain a general feat at 1st total character level, and again at 3rd, 6th, 9th, 12th, 15th, and 18th total character level. This is in addition to any bonus feats from class or species.","source_page_reference":"CR 37, 79"},"talents_progression_by_heroic_class_level":{"description":"Heroic characters typically select a talent from their class's available talent trees at 1st level in that class, and again at every odd-numbered class level gained in that specific heroic class (e.g., 3rd, 5th, 7th class level). This is separate from prestige class talent progression. See 'talents_rules.json' for more general talent rules.","source_page_reference":"CR 36, 37 (Table 3-1 implies this for 'Class Feature')"},"ability_score_increases_by_character_level":{"levels":[4,8,12,16,20],"benefit":"Increase two different ability scores by +1 each.","retroactivity":"Ability score increases are retroactive (e.g., an INT increase affects trained skills and known languages).","multiclass_note":"Gained according to overall character level.","source_page_reference":"CR 20, 37"},"source_page_reference":"CR 37-38"}}},
  {
    "target_file_key": "force_rules",
    "action": "update",
    "identifier": {
      "name": "Force System Core Rules",
      "source_book": "CR"
    },
    "payload": {
      "the_dark_side": {
        "description": "The dark side offers a quicker, easier path to power, but it corrupts and ultimately consumes those who embrace it.",
        "dark_side_score_dss": {
          "tracking": "Characters track their Dark Side Score (DSS), which starts at 0.",
          "gaining_dark_side_points": [
            "Knowingly performing an evil act that causes harm to another (e.g., murder, torture, betrayal for personal gain).",
            "Using a Force power with the [dark side] descriptor.",
            "Using a talent, technique, or secret that explicitly states it increases the Dark Side Score."
          ],
          "immediate_effect_of_gaining_dss_point": "Regain all spent Force Points and move +1 step up the condition track."
        },
        "consequences_of_dark_side_score": [
          {
            "condition": "DSS equals Wisdom score",
            "effect": "Character becomes an agent of the dark side, treating NPCs as hostile and PCs as unfriendly by default. Must make a DC 20 Will save to perform any action aiding another if it doesn't directly benefit self or the dark side. This also occurs if the character’s Wisdom score is reduced to be equal to or less than their current Dark Side Score.",
            "errata_applied": "Clarification on Wisdom score reduction triggering agent of the dark side status from CRB Errata p.291."
          },
          {
            "condition": "DSS equals Constitution score",
            "effect": "Character becomes wholly consumed by the dark side and is lost as a playable character (becomes an NPC under GM control)."
          }
        ],
        "atoning_for_dark_side_points": {
          "process": "Character must consciously choose to turn from the dark side and perform acts of good or self-sacrifice over a period of time. At the end of an adventure where such acts occur, can spend a Force Point to reduce DSS by 1. GM determines when atonement is complete.",
          "source_page_reference": "CR 94"
        },
        "dramatic_heroism": {
          "description": "Performing an act of dramatic heroism (risking self for others or a noble cause without expectation of reward) can sometimes allow a character to avoid gaining a Dark Side Point for an otherwise dark act necessary to achieve the heroic goal, at GM discretion.",
          "source_page_reference": "CR 94"
        },
        "source_page_reference": "CR 93-94"
      }
    }
  },
  {
    "target_file_key": "combat_rules",
    "action": "update",
    "identifier": { 
      "file_description": "Core rules for combat in Star Wars Saga Edition, including the combat round, initiative, and action types. This file is designed to be extensible with rules from other sourcebooks."
    },
    "payload": {
      "attack_rolls": {
        "description": "An attack roll represents your attempt to strike your opponent, usually made against the target's Reflex Defense.",
        "formula_string": "d20 + Base Attack Bonus + Ability Modifier + Size Modifier (for vehicles/starships) + Miscellaneous Modifiers",
        "components": [
          {"name": "d20_roll", "description": "A roll of a 20-sided die."},
          {"name": "base_attack_bonus_bab", "description": "Derived from class and level."},
          {"name": "ability_modifier", "options": [
            {"type": "melee_attacks", "ability": "Strength"},
            {"type": "ranged_attacks", "ability": "Dexterity"}
          ]},
          {"name": "size_modifier", "description": "Applies only to vehicles and starships, not usually to characters."},
          {"name": "miscellaneous_modifiers", "description": "Includes bonuses or penalties from feats, talents, range penalties, cover, concealment, fighting defensively, aiming, etc."}
        ],
        "automatic_miss": "A natural 1 (the d20 comes up 1) on an attack roll is always an automatic miss, regardless of modifiers.",
        "automatic_hit_and_critical_threat": "A natural 20 (the d20 comes up 20) on an attack roll is always an automatic hit. It also 'threatens' a critical hit.",
        "critical_hits": {
          "description": "An attack that threatens a critical hit might deal more damage than normal.",
          "confirming_a_critical_hit": "To confirm a critical hit, reroll the attack. If the second attack roll is also a success (i.e., it would also hit the target's Reflex Defense), the critical hit is confirmed. All modifiers to the attack roll, except for bonuses from spending a Force Point or Destiny Point on the initial roll, apply to this confirmation roll.",
          "damage_if_confirmed": "If confirmed, a critical hit deals double damage. Roll your damage dice (including any modifiers such as Strength bonus or heroic level damage bonus) twice and total the results. Some weapons, feats, or talents may modify critical hit effects.",
          "damage_if_not_confirmed": "If the confirmation roll is a miss, the original attack is still a hit, but it deals only normal damage."
        },
        "targeting_an_object": "Attacks against objects use a DC based on the object's size (see Chapter 8: Equipment).",
        "targeting_a_square": "Attacks can target a specific square, typically against Reflex Defense 10. Success means the attack hits that square and deals damage as normal. This is common for area attacks.",
        "source_page_reference": "CR 146-147"
      },
      "damage_rules": {
        "description": "Rules for determining and applying damage from successful attacks.",
        "rolling_damage": "If an attack succeeds, roll the appropriate damage dice for the weapon or effect used. This roll typically includes modifiers.",
        "minimum_damage": "If penalties to damage reduce the damage to 0 or less, a hit still deals 1 point of damage.",
        "ability_modifier_to_damage": {
          "melee_weapons": "Add Strength modifier to melee weapon damage rolls.",
          "thrown_weapons": "Add Strength modifier to damage rolls for thrown weapons.",
          "exceptions": "Grenades do not have their damage modified by Strength."
        },
        "multiplying_damage": "When damage is multiplied (e.g., from a critical hit), roll the damage (with all modifiers) multiple times as indicated and total the results. Extra dice from other sources (like Sneak Attack) are not multiplied on a critical hit unless specified otherwise.",
        "hit_points": {
          "definition": "Hit points (HP) represent how much punishment a character can take before becoming seriously impaired or dying.",
          "losing_hit_points": "Damage from attacks, traps, Force powers, or other hazards reduces a character's current hit points.",
          "effects_of_hp_damage": [
            {"condition": "Hit points drop to 0","effect": "Character is disabled and can take only a single move action or swift action each turn. If damage moves the character to exactly 0 HP, they also move -1 step on the condition track."},
            {"condition": "Hit points drop below 0 (negative HP)","effect": "Character is unconscious and dying. If hit points drop to a negative amount equal to or greater than the character's Constitution score, the character dies."}
          ],
          "stabilizing_at_0_hp_or_negative_hp": "A dying character (negative HP but not yet at negative CON score) loses 1 HP per round until stabilized. A character at 0 HP is disabled and in danger of dying if they take further damage. On their next turn after reaching 0 HP, if they take no action, they become stable (but still at 0 HP and disabled). A successful DC 15 Treat Injury check (First Aid) can also stabilize a dying character or a character at 0 HP.",
          "regaining_hit_points_summary": "Methods include natural healing (CON modifier per day for 8 hours rest), the Treat Injury skill, and some Force powers."
        },
        "source_page_reference": "CR 147-148"
      },
      "defense_scores": {
        "description": "A target's Defense scores represent its ability to avoid being hit (Reflex Defense), shrug off physical hardship (Fortitude Defense), or resist mental influence (Will Defense).",
        "reflex_defense": {
          "formula_string": "10 + Heroic Level (or Armor Bonus) + Dexterity modifier + Class Bonus + Natural Armor Bonus (if any) + Size Modifier + miscellaneous modifiers",
          "components_note": "The higher of Heroic Level or Armor Bonus (from worn armor, if proficient) is used.",
          "flat_footed": "A character who is flat-footed loses their Dexterity bonus (if any) to Reflex Defense. This typically occurs before a character has acted in the first round of combat or when surprised.",
          "denied_dexterity_bonus_other_situations": "Other situations where Dexterity bonus to Reflex Defense is lost include climbing, balancing, squeezing through tight spaces, or when helpless, stunned, or pinned.",
          "source_page_reference": "CR 148"
        },
        "fortitude_defense": {
          "formula_string": "10 + Heroic Level + Constitution modifier + Class Bonus + miscellaneous modifiers (including equipment bonuses from armor)",
          "source_page_reference": "CR 148"
        },
        "will_defense": {
          "formula_string": "10 + Heroic Level + Wisdom modifier + Class Bonus + miscellaneous modifiers",
          "source_page_reference": "CR 148"
        },
        "damage_threshold": {
          "description": "If an attack deals damage that meets or exceeds a target's Damage Threshold, the target moves -1 step along the condition track in addition to taking damage.",
          "formula_string": "Fortitude Defense + Size Modifier (for Large or larger targets)",
          "size_modifiers_to_threshold": [
            {"size": "Large", "modifier": "+5"},
            {"size": "Huge", "modifier": "+10"},
            {"size": "Gargantuan", "modifier": "+20"},
            {"size": "Colossal (and larger)", "modifier": "+50"}
          ],
          "source_page_reference": "CR 148"
        }
      }
    }
  },
  {
    "target_file_key": "combat_rules",
    "action": "update",
    "identifier": {
      "file_description": "Core rules for combat in Star Wars Saga Edition, including the combat round, initiative, and action types. This file is designed to be extensible with rules from other sourcebooks."
    },
    "payload": {
      "condition_track": {
        "description": "The condition track measures a character's current well-being and combat effectiveness, with five steps imposing cumulative penalties. Moving to the bottom of the track renders a character helpless or unconscious.",
        "source_page_reference": "CR 148-149",
        "steps_and_penalties": [
          {"step_value": 0, "condition_name": "Normal", "penalty_description": "No penalties."},
          {"step_value": -1, "condition_name": "Persistent Condition -1", "penalty_description": "-1 penalty on attack rolls and skill checks."},
          {"step_value": -2, "condition_name": "Persistent Condition -2", "penalty_description": "-2 penalty on attack rolls and skill checks."},
          {"step_value": -5, "condition_name": "Persistent Condition -5", "penalty_description": "-5 penalty on attack rolls and skill checks."},
          {"step_value": -10, "condition_name": "Persistent Condition -10", "penalty_description": "-10 penalty on attack rolls and skill checks."},
          {"step_value": "Bottom_of_Track", "condition_name": "Helpless/Unconscious", "penalty_description": "Character is helpless. If moved to the bottom of the track as a result of damage, the character falls unconscious."}
        ],
        "moving_on_the_track": {
          "damage_threshold_interaction": "If an attack deals damage that meets or exceeds a target's Damage Threshold, the target moves -1 step down the condition track in addition to taking damage.",
          "other_effects": "Talents, Force powers, critical hits, poisons, diseases, and other special circumstances can also cause a character to move along the condition track.",
          "cumulative_effects": "Effects that move a character on the condition track are cumulative. However, a character cannot be moved more than one step down the track from a single attack unless a specific ability (like a critical hit effect or certain talents) states otherwise."
        },
        "recovering_on_the_track": {
          "second_wind": {
            "description": "Once per day, a heroic character can catch a second wind by spending three swift actions (which can be spread over multiple rounds). This moves the character +1 step up the condition track and allows them to regain hit points equal to one-quarter of their maximum hit points (rounded down).",
            "action_cost": "Three swift actions.",
            "frequency": "Once per day (heroic characters only).",
            "benefit": "Move +1 step up the condition track; regain HP = floor(max_HP / 4).",
            "errata_note": "Errata (CRB p.297) notes Second Wind can only be used once per encounter."
          },
          "other_recovery_methods": "Some talents, Force powers, or the Treat Injury skill can allow a character to move up the condition track.",
          "end_of_encounter": "Normally, unless specified as a persistent condition, a character returns to the top of the condition track (Normal) at the end of an encounter."
        },
        "persistent_conditions": {
          "description": "Some effects cause a persistent condition. A persistent condition is noted on the condition track and does not go away at the end of an encounter.",
          "removal": "Removing a persistent condition typically requires specific actions such as an extended period of rest (usually 8 hours), successful use of the Treat Injury skill, or specific Force powers. The duration or removal method is specified by the effect that caused it."
        }
      },
      "movement_and_position": {
        "description": "Rules governing character and vehicle movement, positioning, and interaction with terrain and other entities on the battlefield.",
        "source_page_reference": "CR 149-151",
        "speed": {
          "definition": "A character's speed determines how far they can move in a round using a move action.",
          "types": ["Land", "Swim", "Fly", "Burrow"],
          "moving_as_move_action": "Move up to speed.",
          "moving_as_standard_action_trade_off": "Can take an additional move action by giving up standard action (total 2x speed).",
          "running_as_full_round_action": "Move up to 4x speed in a straight line (3x in heavy armor or with heavy load); lose Dexterity bonus to Reflex Defense. Endurance check may be required for sustained running."
        },
        "moving_through_a_square": {
          "unoccupied": "No special rules.",
          "occupied_by_ally": "Can move through an ally's square freely.",
          "occupied_by_enemy": {
            "general_rule": "Cannot normally move through an enemy's square.",
            "exceptions": [
              "If enemy is helpless or unaware of your presence.",
              "Using Acrobatics skill (Tumble application, DC 15) to move through a threatened or occupied square (counts as 2 squares of movement).",
              "Making an Overrun special attack (see Special Attacks)."
            ]
          },
          "very_small_creatures": "Diminutive or Fine creatures can often move through squares occupied by larger creatures without penalty."
        },
        "difficult_terrain": {
          "definition": "Terrain that slows movement, such as dense undergrowth, deep sand, rubble, or steep stairs.",
          "cost_to_enter": "Costs 2 squares of movement to enter a square of difficult terrain (e.g., moving 1 square into difficult terrain costs 2 squares of speed).",
          "diagonal_movement": "Moving diagonally into a difficult terrain square costs 3 squares of movement."
        },
        "obstacles": {
          "low_obstacles": "Obstacles less than 1 meter high (e.g., crates, low walls) cost 2 squares of movement to cross.",
          "hampering_terrain": "Walls, fences, or very narrow surfaces may require Climb or Acrobatics checks to navigate."
        },
        "flanking": {
          "description": "If you and an ally are on opposite sides of an opponent and both are threatening that opponent, you are flanking.",
          "benefit": "You and your flanking ally each gain a +2 bonus on melee attack rolls against the flanked opponent.",
          "requirements": ["Must be on opposite sides (a line drawn between you and your ally must pass through opposite sides of the opponent's fighting space).", "Both must be threatening the opponent."]
        },
        "prone_condition": {
          "description": "Lying on the ground.",
          "effects_on_character": [
            "-5 penalty on melee attack rolls.",
            "Cannot make ranged attacks unless using a weapon that can be fired while prone (e.g., some pistols or specially designed rifles) or has a specific feat/talent.",
            "Opponents gain a +5 bonus on melee attack rolls against the prone character.",
            "Opponents take a -5 penalty on ranged attack rolls against the prone character."
          ],
          "actions": {
            "standing_up": "Move action that provokes an Attack of Opportunity. (Acrobatics DC 15, Trained Only, allows standing as a swift action).",
            "dropping_prone": "Swift action that does not provoke an Attack of Opportunity. (Acrobatics DC 15, Trained Only, allows dropping prone as a free action)."
          }
        },
        "squeezing": {
          "description": "Moving through a space at least half as wide as your normal fighting space, but smaller than it.",
          "movement_cost": "Costs 2 squares of movement to enter a square you are squeezing into.",
          "penalties_while_squeezing": "-5 penalty on all attack rolls and -5 penalty to Reflex Defense."
        }
      },
      "attacks_of_opportunity": {
        "description": "Attacks of opportunity (AoOs) are free melee attacks a character can make against a target that lets its guard down in combat within the character's threatened area.",
        "source_page_reference": "CR 151-152",
        "reach_and_threatened_area": "Typically all squares adjacent to the character. Reach weapons extend this area.",
        "provoking_an_aoo": [
          {"action": "Moving out of a threatened square","notes": "Only the first square of movement provokes. Withdrawing is a specific action to avoid this."},
          {"action": "Making a ranged attack while threatened","notes": "If an enemy is adjacent to you."},
          {"action": "Using certain skills while threatened","skills_examples": ["Concentration (usually for Force powers)","Mechanics","Treat Injury","Use Computer","Use the Force (for powers)"],"notes": "GM discretion for other distracting skills."},
          {"action": "Other specific actions","notes": "As specified by certain maneuvers or at GM discretion (e.g., standing up from prone)."}
        ],
        "making_an_aoo": {
          "type": "Free melee attack.",
          "attack_bonus": "Normal melee attack bonus.",
          "reaction_cost": "Uses the character's reaction for the round.",
          "flat_footed_restriction": "Cannot make AoOs while flat-footed or otherwise unable to react."
        },
        "limit_per_round": "Normally, a character can make only one Attack of Opportunity per round, regardless of how many actions provoke one.",
        "combat_reflexes_feat_interaction": "The Combat Reflexes feat allows a character to make additional AoOs per round, up to their Dexterity bonus, and allows AoOs while flat-footed.",
        "multiple_aoos_from_one_action": "Only one AoO can be taken for any single provoking action by an opponent, even if multiple characters threaten that opponent or if one character has multiple AoOs available."
      },
      "aid_another_in_combat": {
        "description": "As a standard action, a character can attempt to aid an ally's attack or hinder an opponent's attack. This is a specific application of the Aid Another general rule.",
        "source_page_reference": "CR 151 (also see general Aid Another p.61-62)",
        "to_aid_an_allys_attack": {
          "action_cost": "Standard Action.",
          "requirement": "Must be in a position to attack the opponent the ally is targeting.",
          "mechanic": "Make an attack roll against Reflex Defense 10.",
          "success_outcome": "Ally gains a +2 circumstance bonus on their next attack roll against that specific opponent, provided the attack occurs before the start of your next turn.",
          "failure_outcome": "Ally gains no bonus."
        },
        "to_suppress_an_enemy": {
          "action_cost": "Standard Action.",
          "requirement": "Designate one opponent.",
          "mechanic": "Make an attack roll against Reflex Defense 10.",
          "success_outcome": "The designated opponent takes a -2 circumstance penalty on their next attack roll, provided the attack occurs before the start of your next turn.",
          "failure_outcome": "Opponent takes no penalty."
        }
      },
      "cover_and_concealment": {
        "description": "Rules governing how obstacles and visibility affect combat.",
        "source_page_reference": "CR 155-156",
        "cover": {
          "definition": "Anything that physically blocks attacks, such as a wall, a large crate, or another character.",
          "granting_cover": "Cover is granted if a line from the attacker to any part of the target's square passes through an obstacle or another creature.",
          "reflex_defense_bonus": {
            "standard_cover": "+5 cover bonus to Reflex Defense.",
            "improved_cover": "+10 cover bonus to Reflex Defense (e.g., target is prone behind a low wall, or only their head is exposed).",
            "total_cover": "Target cannot be targeted directly by attacks or Force powers that require line of sight."
          },
          "soft_cover": "Cover provided by another character, creature, or droid grants a +5 cover bonus to Reflex Defense."
        },
        "concealment": {
          "definition": "Anything that makes it harder to see a target, such as darkness, shadows, fog, smoke, or invisibility.",
          "miss_chance": {
            "standard_concealment": "Attacks against a target with concealment suffer a 20% miss chance. If the attack hits, the attacker must roll d100; a result of 1-20 means the attack misses due to concealment.",
            "total_concealment": "Attacks against a target with total concealment suffer a 50% miss chance. Attacker must typically guess the target's square. A successful guess still requires rolling for the miss chance."
          },
          "ignoring_concealment": "Darkvision negates concealment from darkness (but not total concealment from darkness). Some species traits, talents, feats, or Force powers may allow ignoring concealment.",
          "natural_20_vs_concealment": "A natural 20 on an attack roll ignores the miss chance from concealment (but not total concealment). (CRB Errata p.298)"
        }
      }
    }
  },
  {
    "target_file_key": "combat_rules",
    "action": "update",
    "identifier": {
      "file_description": "Core rules for combat in Star Wars Saga Edition, including the combat round, initiative, and action types. This file is designed to be extensible with rules from other sourcebooks."
    },
    "payload": {
      "special_attacks": {
        "description": "Details on various special attack maneuvers available to characters.",
        "source_page_reference": "CR 152-155",
        "maneuvers": [
          {
            "action_name": "Aim",
            "action_cost": "Standard Action (CRB p.154, listed under Full-Round Actions but is a Standard Action to setup an attack)",
            "description": "Carefully aim a ranged weapon or starship weapon before making an attack.",
            "effects_summary": [
              "Gain a +2 circumstance bonus on your next attack roll made before the end of your turn.",
              "Alternatively, you can ignore any cover the target has (but not improved cover).",
              "Alternatively, you can ignore any concealment the target has (but not total concealment)."
            ],
            "target_requirements": "A single target.",
            "notes": "You must choose which benefit to apply before making the attack roll. You cannot aim if you are using autofire.",
            "errata_applied_notes": "CRB Errata p.298: Clarifies 'ignore cover' means the target gains no cover bonus to Reflex Defense from that source of cover."
          },
          {
            "action_name": "Autofire",
            "action_cost": "Standard Action (to make an autofire attack)",
            "description": "Spray a 2x2 square area with fire from an autofire-capable weapon.",
            "effects_summary": [
              "Targets a 2-square-by-2-square area.",
              "Make a single attack roll against Reflex Defense 10 (plus range increment penalties).",
              "If the attack hits, all creatures, droids, and objects in the target area take full weapon damage.",
              "If the attack misses, shots go wild and deal no damage.",
              "Uses 10 shots from the weapon's power pack or ammunition supply."
            ],
            "notes": "Cannot be aimed at a specific target (unless using Burst Fire feat). Cannot make critical hits with autofire. Area attacks ignore cover unless target has total cover. Area attacks ignore concealment unless target has total concealment (in which case, normal 50% miss chance applies).",
            "special_qualities_interaction": "Some talents or feats (like Burst Fire) modify autofire."
          },
          {
            "action_name": "Charge",
            "action_cost": "Full-Round Action",
            "description": "Move up to twice your speed in a straight line and make a single melee attack at the end of your movement.",
            "effects_summary": [
              "Movement must be up to twice your speed in a generally straight line towards the target.",
              "Can move through allies, but not enemies unless they are helpless or you successfully Tumble/Overrun.",
              "Difficult terrain hampers charge movement normally.",
              "Gain a +2 bonus on the melee attack roll.",
              "Take a -2 penalty to Reflex Defense until the start of your next turn."
            ],
            "restrictions": [
              "Must have a clear path to the opponent.",
              "Cannot charge if movement is hampered (e.g., difficult terrain reducing you to less than 1 square of movement).",
              "Must move at least 2 squares to charge."
            ]
          },
          {
            "action_name": "Disarm",
            "action_cost": "Standard Action",
            "description": "Attempt to knock a weapon or held item from an opponent's grasp using a melee attack.",
            "effects_summary": [
              "Make a melee attack roll opposed by the target's Reflex Defense or an opposed grapple check (defender's choice).",
              "If you succeed, the target is disarmed, and the item typically falls into their square (or an adjacent square if target is Large+).",
              "If you fail by 10 or more, you drop your own weapon.",
              "If you are unarmed, you take a -5 penalty on the attack roll.",
              "Target gains +5 bonus to Reflex Defense/grapple check if holding weapon two-handed.",
              "Target gains +10 bonus to Reflex Defense/grapple check if weapon is secured (e.g., locked gauntlet)."
            ],
            "aoo_provocation": "Attempting to disarm an opponent provokes an Attack of Opportunity from that opponent, unless you have a feat or talent that negates this (e.g., Improved Disarm).",
            "errata_applied_notes": "CRB Errata p.297: Clarifies a character making a ranged disarm attack does not provoke an AoO (this usually applies via the Ranged Disarm talent)."
          },
          {
            "action_name": "Fight Defensively",
            "action_cost": "Can be part of a Standard Action (when using the Attack action) or a Full-Round Action (when using the Full Attack action). (CRB p.154 and Errata p.297)",
            "description": "Focus on defense while still being able to attack.",
            "effects_summary": [
              "Take a -5 penalty on all attack rolls made during your turn.",
              "Gain a +2 dodge bonus to your Reflex Defense.",
              "This bonus lasts until the start of your next turn."
            ],
            "errata_applied_notes": "CRB Errata p.297 clarifies it can be used with Attack, Charge, or Full Attack actions."
          },
          {
            "action_name": "Full Attack",
            "action_cost": "Full-Round Action",
            "description": "Make all possible attacks available to you in a round (based on BAB, feats like Double Attack, or wielding multiple weapons).",
            "effects_summary": [
              "If Base Attack Bonus allows multiple attacks (e.g., +6 BAB grants a second attack at -5), you can make them all.",
              "When making more than one attack, all attacks for the round (including AoOs) take a -10 penalty unless using a talent or feat that reduces this (e.g., Dual Weapon Mastery).",
              "Can take a 1-square step before, after, or between attacks in a full attack."
            ],
            "restrictions": "If you move more than a single 1-square step during your turn, you cannot use the Full Attack action.",
            "errata_applied_notes": "CRB Errata p.298 clarifies BAB for iterative attacks: Second attack at BAB-5, third at BAB-10, fourth at BAB-15. The -10 penalty for making more than one attack is a general rule if no specific multi-attack feat/talent is used to mitigate it when, for instance, two-weapon fighting without the feats."
          },
          {
            "action_name": "Grab",
            "action_cost": "Standard Action",
            "description": "Initiate a grapple with an opponent.",
            "effects_summary": [
              "Make a melee attack roll against the target.",
              "If successful, make an opposed grapple check (your grapple modifier vs. target's grapple modifier).",
              "If you win the opposed check, you grab the target. Both you and the target are now considered grappled.",
              "You take a -5 penalty on the initial attack roll to start a grab unless you have a feat or talent that negates this."
            ],
            "aoo_provocation": "Attempting to grab an opponent provokes an Attack of Opportunity from that opponent.",
            "grapple_modifier_formula": "Base Attack Bonus + Strength modifier + Size Modifier (Large +5, Huge +10, etc.)"
          },
          {
            "action_name": "Grapple (Actions while Grappling)",
            "action_cost": "Standard Action",
            "description": "Once grappled, you can take further actions against your grappled opponent.",
            "options_on_your_turn_if_grappling": [
              {"action": "Damage Opponent","details": "Make opposed grapple check. Success: deal unarmed damage to opponent."},
              {"action": "Draw or Holster Weapon","details": "Make opposed grapple check. Success: draw or holster a light weapon."},
              {"action": "Escape from Grapple","details": "Make opposed grapple check OR Acrobatics check (DC = opponent's grapple check result). Success: no longer grappled, can move 1 square away."},
              {"action": "Move","details": "Make opposed grapple check. Success: move yourself and opponent up to half your speed. Opponent moved with you."},
              {"action": "Pin Opponent","details": "Make opposed grapple check. Success: opponent is pinned (see Pin feat or special attack)."}
            ],
            "conditions_while_grappled": [
              "Cannot move unless you win an opposed grapple check to move.",
              "Lose Dexterity bonus to Reflex Defense against opponents not in the grapple.",
              "Take a -5 penalty on attack rolls against opponents not in the grapple."
            ]
          },
          {
            "action_name": "Pin",
            "action_cost": "Standard Action (as part of Grapple action)",
            "description": "Immobilize a grappled opponent. Often requires the Pin feat for full effect.",
            "effects_summary": [
              "Requires a successful opposed grapple check while already grappling.",
              "A pinned creature cannot move or take any actions and loses its Dexterity bonus to Reflex Defense."
            ],
            "notes": "The Pin feat allows pinning as part of a successful grapple that initiates the pin."
          },
          {
            "action_name": "Suppress (as Aid Another)",
            "action_cost": "Standard Action",
            "description": "Use Aid Another to hinder an opponent's attack (see Aid Another in Combat section).",
            "effects_summary": [
              "Designate one opponent.",
              "Make an attack roll against Reflex Defense 10.",
              "Success: Designated opponent takes a -2 circumstance penalty on their next attack roll made before the start of your next turn."
            ]
          },
          {
            "action_name": "Trip",
            "action_cost": "Standard Action",
            "description": "Attempt to knock an opponent prone using a melee attack.",
            "effects_summary": [
              "Make a melee attack roll opposed by the target's Dexterity check or Strength check (defender's choice).",
              "If you succeed, the target is knocked prone.",
              "If you fail by 10 or more, you are knocked prone instead.",
              "If you are unarmed, you take a -5 penalty on your attack roll."
            ],
            "aoo_provocation": "Attempting to trip an opponent provokes an Attack of Opportunity from that opponent, unless you have a feat or talent that negates this (e.g., Improved Trip from some sources, though Trip feat itself in CRB makes it so you are not knocked prone on a fail by 10+)."
          },
          {
            "action_name": "Withdraw",
            "action_cost": "Full-Round Action",
            "description": "Carefully move away from an opponent to avoid provoking an Attack of Opportunity from them for movement.",
            "effects_summary": [
              "Move up to twice your speed.",
              "The first square you move out of does not provoke an Attack of Opportunity from any opponents that threaten that square.",
              "Any other movement during the withdraw may still provoke AoOs from other opponents or if you move through other threatened squares."
            ]
          }
        ]
      }
    }
  },
  {
    "target_file_key": "combat_rules",
    "action": "update",
    "identifier": {
      "file_description": "Core rules for combat in Star Wars Saga Edition, including the combat round, initiative, and action types. This file is designed to be extensible with rules from other sourcebooks."
    },
    "payload": {
      "mounted_combat": {
        "description": "Rules for engaging in combat while riding a creature or vehicle.",
        "source_page_reference": "CR 156-157",
        "general_rules": {
          "mount_initiative": "A mount acts on its rider's Initiative count, as directed by the rider.",
          "rider_actions": "The rider moves at the mount's speed and can perform actions as normal while the mount moves.",
          "directing_mount": "Directing a mount is typically a move action if it's not trained for combat or riding. Warbeasts or animals trained for riding typically do not require an action to guide in normal circumstances."
        },
        "combat_while_mounted": [
          {
            "situation": "Mount as Cover",
            "rule": "You can drop down and hang alongside your mount, using it as cover (+5 bonus to Reflex Defense). You cannot attack or cast Force powers while using your mount as cover. This typically requires a Ride check (DC 15 as per Ride skill, CR p.73)."
          },
          {
            "situation": "Attacks by Rider",
            "rule": "You can make melee or ranged attacks as normal. A charging mount allows you to make a charge attack. If the mount is also attacking, it remains in its space while you attack."
          },
          {
            "situation": "Casting Force Powers",
            "rule": "Casting a Force power while mounted requires a Ride check (DC = 10 + the level of the Force power). Failure means the power fails, but the use of the power is still expended."
          },
          {
            "situation": "If Your Mount is Hit in Combat",
            "rule": "If your mount takes damage equal to or exceeding its damage threshold, you must make a Ride check (DC = damage dealt) to stay mounted. Failure means you are knocked prone in a square adjacent to your mount."
          },
          {
            "situation": "If Your Mount Falls",
            "rule": "If your mount falls (e.g., is knocked prone or killed), you must make a DC 15 Ride check to land safely. Failure means you take 1d6 points of falling damage and fall prone."
          }
        ],
        "special_mount_actions_ride_skill_interaction": "The Ride skill (CR p.73) details specific actions such as 'Fight with War-Trained Mount,' 'Overrun with Mount,' 'Soft Fall from Mount,' and 'Leap with Mount'."
      },
      "aquatic_combat": {
        "description": "Rules for combat occurring in water.",
        "source_page_reference": "CR 157",
        "movement_in_water": {
          "swimming": "Characters without a swim speed move at half their land speed (making a Swim check each round to move one-quarter speed as a move action, or half speed as a full-round action). Creatures with a natural swim speed use that speed.",
          "difficult_conditions": "The Swim skill is used to navigate rough water or perform other difficult maneuvers."
        },
        "melee_attacks_underwater": [
          {"weapon_type": "Unarmed, Slashing, or Bludgeoning","penalty": "-2 penalty on attack rolls, damage is halved."},
          {"weapon_type": "Piercing","penalty": "No penalty."}
        ],
        "ranged_attacks_underwater": [
          {"weapon_type": "Thrown weapons (not specifically designed for underwater use)","rule": "Cannot be used effectively."},
          {"weapon_type": "Projectile weapons (bows, slugthrowers, not specifically designed)","rule": "Cannot be used effectively."},
          {"weapon_type": "Blasters and other energy weapons","rule": "Function normally, but all range increments are halved. (CRB Errata p.298)"}
        ],
        "other_considerations": [
          "Suffocation: Nonamphibious creatures or those without special equipment risk drowning.",
          "Visibility: Often reduced underwater."
        ]
      },
      "zero_gravity_environments": {
        "description": "Rules for combat and movement in zero-gravity (Zero-G).",
        "source_page_reference": "CR 157-158",
        "moving_in_zero_g": [
          {"method": "Pushing Off Surfaces","rule": "Move up to half speed in a straight line. Cannot change direction without another surface to push off from."},
          {"method": "Using Handholds / Magnetic Boots","rule": "Move up to half speed. Requires Climb check (DC 10) for difficult surfaces or maintaining grip under stress."},
          {"method": "Thruster Packs / Jetpacks","rule": "Allow normal movement as per the device's capabilities."},
          {"method": "Zero-G Training (Feat)","rule": "Allows moving normal speed using handholds/surfaces and negates penalties for certain actions in Zero-G."}
        ],
        "attacking_in_zero_g": {
          "melee_attacks": "Suffer a -2 penalty on attack rolls unless trained in Zero-G combat (e.g., via Zero-G Training feat) or using magnetic boots/grappling line to brace.",
          "ranged_attacks": "Generally no penalty, unless using a weapon with significant recoil without being braced, in which case a penalty might apply (GM discretion)."
        },
        "other_zero_g_effects": {
          "space_sickness": "Characters unaccustomed to Zero-G may suffer space sickness (Fortitude DC 15 check after 1 hour, failure results in -1 persistent step on the condition track).",
          "no_down_direction": "Concepts of 'up' and 'down' are relative. Prone condition may not apply conventionally.",
          "object_inertia": "Unsecured objects continue moving in a straight line until acted upon by another force."
        }
      },
      "other_combat_modifiers": {
        "description": "Additional modifiers and rules affecting combat calculations.",
        "source_page_reference": "CR 158-159",
        "attacking_an_object": {
          "general_notes": "Objects are usually immune to critical hits unless specified otherwise. They are automatically hit if immobile, or use a DC based on size if thrown/moving (see Table 9-4).",
          "breaking_objects": "Requires dealing damage that exceeds the object's Hardness and then reduces its Hit Points to 0.",
          "object_hardness": "Subtract from damage dealt. See Table 9-2: Object Hardness and Hit Points & Table 9-3: Substance Hardness and Hit Points for examples.",
          "object_hit_points": "Determined by size and material. See Table 9-2.",
          "energy_damage_vs_objects": "Typically ignores the Hardness of most objects (except those specifically resistant, like starship hulls).",
          "ineffective_weapons": "Some weapons may be ineffective against certain objects (e.g., a vibroblade against a stone wall).",
          "immunities": "Objects are immune to nonlethal damage, ability damage, mind-affecting effects, poison, and disease unless specifically noted.",
          "damaging_vehicles_and_starships": "Use Damage Reduction (DR) and Shield Rating (SR) instead of Hardness (see Chapter 11).",
          "table_9_2_object_hardness_and_hit_points_examples": [
            {"object": "Simple Wooden Door", "hardness": 5, "hit_points": 30, "break_dc": 20},
            {"object": "Strong Wooden Door", "hardness": 5, "hit_points": 60, "break_dc": 25},
            {"object": "Datapad", "hardness": 2, "hit_points": 5, "break_dc": 15, "errata_note": "CRB Errata p.298 changes Datapad HP from 1 to 5."},
            {"object": "Blaster Pistol", "hardness": 10, "hit_points": 15, "break_dc": 20},
            {"object": "Light Repeating Blaster", "hardness": 10, "hit_points": 30, "break_dc": 25}
          ],
          "table_9_3_substance_hardness_and_hit_points_examples": [
            {"substance": "Glass", "hardness": 1, "hp_per_2_5_cm_thickness": 1},
            {"substance": "Ice", "hardness": 0, "hp_per_2_5_cm_thickness": 3},
            {"substance": "Wood", "hardness": 5, "hp_per_2_5_cm_thickness": 10},
            {"substance": "Stone", "hardness": 8, "hp_per_2_5_cm_thickness": 15},
            {"substance": "Iron or Steel", "hardness": 10, "hp_per_2_5_cm_thickness": 30},
            {"substance": "Reinforced Concrete", "hardness": 8, "hp_per_30_cm_thickness": 180},
            {"substance": "Starship Hull (Durasteel)", "hardness": 15, "hp_per_2_5_cm_thickness": 30}
          ],
          "table_9_4_dcs_to_break_or_burst_items_examples": [
            {"action": "Break down simple door", "strength_check_dc": 20},
            {"action": "Break down strong door", "strength_check_dc": 25},
            {"action": "Burst Ropes", "strength_check_dc": 23},
            {"action": "Bend Iron Bars", "strength_check_dc": 24}
          ]
        },
        "damage_reduction_dr": {
          "description": "DR subtracts a specific amount from damage dealt by most attacks. Damage cannot be reduced below 0.",
          "stacking_note": "DR from multiple sources generally does not stack unless the sources are of different types (a rare occurrence)."
        },
        "shield_rating_sr": {
          "description": "Shields absorb damage. Damage is applied to SR first. Once SR is depleted, any remaining damage applies to HP. SR typically regenerates over time.",
          "regeneration": "Personal shields regenerate 5 points of SR at the start of the wielder's turn, up to their maximum SR. Vehicle/starship shields also regenerate (see Chapter 11)."
        },
        "improvised_weapons": {
          "attack_penalty": "-5 penalty on attack rolls.",
          "damage": "Determined by GM based on size and nature (e.g., Small club 1d4, Medium club 1d6).",
          "range_increment": "2 squares if thrown.",
          "critical_hit": "Threaten on natural 20, deal x2 damage.",
          "notes": "Not considered armed when using an improvised weapon for purposes of provoking AoOs unless it's similar to an actual weapon."
        },
        "size_modifiers_table_9_1": {
          "description": "Modifiers for size to Reflex Defense and attack rolls.",
          "applies_to_attack_rolls": "Only for Colossal (station) and Colossal (cruiser) against smaller targets.",
          "categories": [
            {"size_category": "Fine", "reflex_defense_modifier": 10, "attack_modifier_against_smaller": null, "notes":"Example: Remote"},
            {"size_category": "Diminutive", "reflex_defense_modifier": 5, "attack_modifier_against_smaller": null, "notes":"Example: Mouse Droid"},
            {"size_category": "Tiny", "reflex_defense_modifier": 2, "attack_modifier_against_smaller": null, "notes":"Example: Training Remote"},
            {"size_category": "Small", "reflex_defense_modifier": 1, "attack_modifier_against_smaller": null, "notes":"Example: Ewok, Jawa"},
            {"size_category": "Medium", "reflex_defense_modifier": 0, "attack_modifier_against_smaller": null, "notes":"Example: Human"},
            {"size_category": "Large", "reflex_defense_modifier": -1, "attack_modifier_against_smaller": null, "notes":"Example: Dewback"},
            {"size_category": "Huge", "reflex_defense_modifier": -2, "attack_modifier_against_smaller": null, "notes":"Example: Rancor"},
            {"size_category": "Gargantuan", "reflex_defense_modifier": -5, "attack_modifier_against_smaller": null, "notes":"Example: Krayt Dragon"},
            {"size_category": "Colossal", "reflex_defense_modifier": -10, "attack_modifier_against_smaller": null, "notes":"Example: AT-AT Walker"},
            {"size_category": "Colossal (frigate)", "reflex_defense_modifier": -10, "attack_modifier_against_smaller": null},
            {"size_category": "Colossal (cruiser)", "reflex_defense_modifier": -10, "attack_modifier_against_smaller": 5},
            {"size_category": "Colossal (station)", "reflex_defense_modifier": -10, "attack_modifier_against_smaller": 10}
          ],
          "errata_note": "CRB Errata p.298 for Table 9-1: For Colossal (droid), the Attack Modifier is +0 (not listed in base table, but is a size for some droids)."
        },
        "starvation_and_thirst": {
          "description": "Prolonged lack of food or water can lead to penalties and eventually death. Resisted with Endurance checks.",
          "reference": "Detailed rules in Survival skill (Chapter 4) and Endurance skill (Chapter 4)."
        }
      }
    }
  }
]