[
{"target_file_key":"prestige_classes","action":"update","identifier":{"name":"Ace Pilot","source_book":"CR"},"payload":{"id":"ace_pilot_cr_206","description_general":"The Ace Pilot is a master of vehicle combat, treating their starship or airspeeder as an extension of themselves. They are veterans of countless engagements, known for their daring maneuvers, exceptional skill in the cockpit, and ability to push vehicles to their absolute limits, often defining themselves by the craft they fly. [Sourced from CRB p.206]"}},
{"target_file_key":"prestige_classes","action":"update","identifier":{"name":"Bounty Hunter","source_book":"CR"},"payload":{"id":"bounty_hunter_cr_207","description_general":"The Bounty Hunter is a relentless tracker and formidable combatant, specializing in the pursuit and capture of targets across the galaxy. They are often shrouded in mystery, utilizing keen survival skills, specialized equipment, and a network of contacts to bring in their quarry, dead or alive, for a price. [Sourced from CRB p.207-208]"}},
{"target_file_key":"prestige_classes","action":"update","identifier":{"name":"Crime Lord","source_book":"CR"},"payload":{"id":"crime_lord_cr_209","description_general":"The Crime Lord is a mastermind of illegal enterprises, wielding influence and power within the galactic underworld. They are adept at manipulation, persuasion, and organizing networks of operatives, often building vast criminal empires through cunning, ruthlessness, and a keen understanding of illicit markets. [Sourced from CRB p.209]"}},
{"target_file_key":"prestige_classes","action":"update","identifier":{"name":"Elite Trooper","source_book":"CR"},"payload":{"id":"elite_trooper_cr_211","description_general":"The Elite Trooper represents the pinnacle of soldiery, having honed their combat skills through rigorous training and extensive battlefield experience. They are masters of weaponry and armor, demonstrating exceptional endurance, tactical awareness, and the ability to perform incredible feats of martial prowess, often serving as special forces or shock troops. [Sourced from CRB p.211]"}},
{"target_file_key":"prestige_classes","action":"update","identifier":{"name":"Force Adept","source_book":"CR"},"payload":{"id":"force_adept_cr_212","description_general":"The Force Adept is an individual who, often without formal Jedi or Sith training, has learned to touch and manipulate the Force through intuition, personal experience, or obscure traditions. They walk a unique path, their abilities shaped by their innate connection to the Force, often excelling in less common applications of its power and developing a deep, personal understanding of its workings. [Sourced from CRB p.212-213]"}},
{"target_file_key":"prestige_classes","action":"update","identifier":{"name":"Gunslinger","source_book":"CR"},"payload":{"id":"gunslinger_cr_216","name":"Gunslinger","description_general":"The Gunslinger is a master of ranged combat, particularly with pistols and other sidearms, capable of incredible feats of speed and accuracy. They are deadly shots, relying on quick reflexes, uncanny aim, and often a bit of style to overcome foes in fast-paced shootouts. [Sourced from CRB p.216]"}},
{"target_file_key":"prestige_classes","action":"update","identifier":{"name":"Jedi Knight","source_book":"CR"},"payload":{"id":"jedi_knight_cr_217","name":"Jedi Knight","description_general":"The Jedi Knight is a guardian of peace and justice in the galaxy, having completed their Jedi training to become a full member of the Jedi Order. Skilled in the ways of the Force and the art of lightsaber combat, they follow the Jedi Code, striving to protect the innocent, uphold the ideals of the Republic (or the light), and confront the darkness. [Sourced from CRB p.217]"}},
{"target_file_key":"prestige_classes","action":"update","identifier":{"name":"Jedi Master","source_book":"CR"},"payload":{"id":"jedi_master_cr_219","name":"Jedi Master","description_general":"A Jedi Master represents a pinnacle of achievement within the Jedi Order, possessing profound wisdom, exceptional skill in the Force, and a deep understanding of its mysteries. They often serve as leaders, teachers to new generations of Jedi, and powerful champions of the light side, having faced many trials and demonstrated exemplary dedication to the Jedi Code. [Sourced from CRB p.219-220]"}},
{"target_file_key":"prestige_classes","action":"update","identifier":{"name":"Officer","source_book":"CR"},"payload":{"id":"officer_cr_220","name":"Officer","description_general":"The Officer is a leader of military forces, skilled in tactics, command, and inspiring troops on the battlefield or aboard starships. They are responsible for strategy, unit cohesion, and achieving objectives, whether serving planetary militias, sector forces, or the grand armies and navies of major galactic powers. [Sourced from CRB p.220-221]"}},
{"target_file_key":"prestige_classes","action":"update","identifier":{"name":"Sith Apprentice","source_book":"CR"},"payload":{"id":"sith_apprentice_cr_223","name":"Sith Apprentice","description_general":"The Sith Apprentice walks the path of darkness under the tutelage of a Sith Master, learning the forbidden secrets of the Sith Order and cultivating their power in the dark side of the Force. Driven by ambition, hatred, or a desire for ultimate control, they embrace the Sith Code and seek to master their passions to achieve strength. [Sourced from CRB p.223]"}},
{"target_file_key":"prestige_classes","action":"update","identifier":{"name":"Sith Lord","source_book":"CR"},"payload":{"id":"sith_lord_cr_224","name":"Sith Lord","description_general":"A Sith Lord has achieved a significant degree of mastery over the dark side of the Force and typically commands considerable power and influence within the Sith Order or their own dark domain. They are figures of immense personal power, cunning, and cruelty, fully dedicated to the Sith philosophy of strength through passion and the pursuit of galactic domination or personal apotheosis through the dark side. [Sourced from CRB p.224]"}}
]