{
  "templates_data": {
    "description": "Compilation of Templates for Star Wars SAGA Edition.",
    "templates_list": [
      {
        "id": "advanced_ship_s",
        "name": "Advanced Ship",
        "source_book": "S",
        "page": 59,
        "applies_to_type": "Vehicle",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "An advanced ship is on the cutting edge of technology, one that includes numerous new systems and improvements to old systems. Individual prototypes of new ship classes, specially modified private vessels for the rich and powerful, and special ships built by cultures that have particularly advanced technology are all represented by adding this template to standard starships.\nAdvanced ships are rarely a class of vessel. Even the most cutting-edge culture can't make more than a few of these vessels at a time. They require regular maintenance (taking 1 day and a DC 30 Mechanics check each week) or move -1 persistent step on the condition track until missed Mechanics checks are made.\nMODIFICATIONS To create an advanced starship, make the following changes to an existing starship.\nCL: The CL of an advanced ship is 125% its normal value (round up).\nSR: Increase the ship's SR by an amount based on its size: Huge +5, Gargantuan + 10, Colossal +20, Colossal (frigate) +30, Colossal (cruiser) +40, Colossal (station) +50. If the base ship doesn't have shields normally, give it shields with a total SR of double the given bonus + 10.\nHit Points: Increase by 25%.\nStrength: Increase Strength by the following bonus based on size; Huge +2, Gargantuan +6, Colossal + 10, Colossal (frigate) + 16, Colossal (cruiser) +22, Colossal (station) +36. Increase Fort Defense, damage threshold, and Grapple to represent the new Strength modifier.\nDexterity: Increase the Dexterity of Huge and Gargantuan starships by 8, Colossal (station) ships by 2, and all others by 4. Increase Initiative, Reflex Defense, and Pilot check to represent the new Dexterity modifier.\nIntelligence: Increase Intelligence by 4. Increase your weapon attack bonuses to represent your new Intelligence modifier.\nWeapons: Increase the damage dealt by all weapons by 1 die.\nCost: Advanced ships are normally cutting-edge prototypes with project costs easily reaching millions of credits.",
        "modifications_summary_text": "CL 125%; hp+25%; Int +4; Weapons +1 die damage; SR, STR, DEX increase based on size",
        "structured_modifications": [
          {
            "text_description": "CL 125%",
            "target_stat": "CL",
            "change_type": "set_to_percentage_of_base",
            "value": 1.25
          },
          {
            "text_description": "hp+25%",
            "target_stat": "Hit Points",
            "change_type": "percentage_delta",
            "value": 0.25
          },
          {
            "text_description": "Int +4",
            "target_stat": "Int",
            "change_type": "additive_amount",
            "value": 4
          },
          {
            "text_description": "Weapons +1 die damage",
            "target_stat": "Weapons",
            "change_type": "additive_amount",
            "value": 1
          },
          {
            "text_description": "SR, STR, DEX increase based on size",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "akk_dog_c",
        "name": "Akk Dog",
        "source_book": "C",
        "page": 57,
        "applies_to_type": "Sentient",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "When a character gains an akk dog follower, the follower gains the species traits of the akk dog described below. Akk dogs are considered beasts. Abilities: Akk dogs have set ability scores. They use the following statistics: Strength 16, Dexterity 8, Constitution 12, Wisdom 10, Intelligence 2, Charisma 8.\nLarge Size: Akk dogs take a -1 size penalty to Reflex Defense and a -5 size penalty to Stealth checks. Their lifting and carrying limits are double those of Medium characters.\nSpeed: An akk dog's base speed is 6 squares.\nNatural Armor: Akk dogs gain a +2 natural armor bonus to Reflex Defense.\nNatural Weapon: When an akk dog makes an unarmed attack, it can use its natural weapons, dealing 1d6 points of slashing damage (plus its Strength modifier) with that attack instead of normal unarmed damage.",
        "modifications_summary_text": null,
        "structured_modifications": []
      },
      {
        "id": "antiquated_weapon_l",
        "name": "Antiquated",
        "source_book": "L",
        "page": 100,
        "applies_to_type": "Vehicle",
        "availability_modification": {
          "text_original": "Rare",
          "set_to": "Rare",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "Used sale price or 60%",
          "options": [
            {
              "type": "set_to_used_price",
              "description": "Used sale price"
            },
            {
              "type": "set_to_percentage_of_base",
              "value": 0.6
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Antiquated vehicles are relics from recent history; maybe a few of these vehicles can be seen plying the space lanes, but many are either novelties or vehicles that are barely holding themselves together. While not so old as to be called archaic, these vehicles have not rolled off of the assembly lines in a long while.\nCL: Reduce the base ship's CL by -2.\nThreshold: An antiquated vehicle's superstructure lacks many of the advancements that hold the vehicle together when struck by modern weapons fire. Reduce the vehicle's damage threshold by 25%.\nBase Attack Bonus : An antiquated vehicle lacks updates to sensors that overcome modern vehicles' defensive countermeasures. Apply a -2 penalty to the vehicle's base attack bonus and al l attacks made with its vehicle weapons.\nAvailability: All antiquated vehicles gain the Rare availability, if they do not already have it.\nCost : Antiquated vehicles are only available at their used sale price. If an antiquated vehicle does not have a used sale price, calculate it as 60% of the original new price. All antiquated vehicles are considered to be used.\nRepairs: Antiquated vehicles do not use modern technology and are likely to be unfamiliar to most ship engineers. The base DC of any Mechanics checks made to build or repair the antiquated vehicle increases by +5. Refitting: An antiquated vehicle can be refitted (see the Mechanics skill, page 31). Apply the refitted template to the base vehicle instead of the antiquated template.",
        "modifications_summary_text": "Ship CL -2. TH -25%. ATK Bonus -2. Repairs +5 DC. Can be refitted.",
        "structured_modifications": [
          {
            "text_description": "Ship CL -2. TH -25%. ATK Bonus -2. Repairs +5 DC. Can be refitted.",
            "target_stat": "Ship Cl",
            "change_type": "subtractive_amount",
            "value": 2
          }
        ]
      },
      {
        "name": "Antiquated",
        "source_book": "L",
        "page": 100,
        "applies_to_type": "Weapon",
        "availability_modification": {
          "text_original": "Rare",
          "set_to": "Rare",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10%",
          "options": [
            {
              "type": "percentage_delta",
              "value": 0.1
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "This weapon template can be applied to any weapon that doesn't appear in the Saga Edit ion core rulebook and represents pre-Legacy era technology. Most antiquated weapons are still fully functional but do not take advantage of the latest technological advancements.\nCost: Antiquated weapons have their prices increased by 10% due to rarity.\nAvailability : All antiquated weapons gain the Rare availability, if they do not already have it.\nEnergy Cells and Power Packs : Energy cells and power packs for antiquated weapons cost 50% more than a standard energy cell or power pack. Unless otherwise specified, an antiquated weapon cannot use standard energy cells or power packs, only antiquated energy cells or power packs.\nRepairs: Antiquated weapons do not use modern technology and are likely to be unfamiliar to most weaponsmiths. An antiquated weapon increases the base DC of any Mechanics checks made to build or repair the weapon by +5.\nRefitting: An antiquated weapon can be refitted (see the Mechanics skill, page 31) . Apply the refitted template to the base weapon instead of the antiquated template.",
        "modifications_summary_text": "Cannot use regular energycells/powerpacks, must be antiquated and cost +50%. Repair is done at +5 DC. Can be refitted.",
        "structured_modifications": [
          {
            "text_description": "Cannot use regular energycells/powerpacks, must be antiquated and cost +50%. Repair is done at +5 DC. Can be refitted.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "arakyd_industries_sgd",
        "name": "Arakyd Industries",
        "source_book": "SGD",
        "page": 15,
        "applies_to_type": "Droid",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Bolstered by the rise of the Emperor and a skillful political strategy, Arakyd Industries is the primary producer of the Empire's military droids. The company's specialties are exploration droids and probe droids, but it also produces commercial units. Arakyd 's market dominance enables it to supply the New Republic in later years, despite the company's Imperial dealings. It also contracts with other major forces, such as planetary governments and the Sector Rangers. Arakyd utilizes Mechis III plants, among others.\nTraits: Arakyd units are well known for their intense mission focus, occasionally going beyond the expected limits of their programming to achieve a mission objective. When confronted with an action that it would normally not be able to perform due to its behavioral inhibitors, it can attempt (through twisting logic or reprogramming) to bypass the normal limitations. Once per day, an Arakyd droid can make a Persuasion check or a Use Computer check against a DC equal to its own Will Defense. If the check is successful, the droid's behavioral inhibitor allows it to take prohibited actions until the forbidden action is completed. After completion, the inhibitor returns to normal functioning.",
        "modifications_summary_text": "1xDay, forbidden action: Persuasion or Use the Force vs Will Def.",
        "structured_modifications": [
          {
            "text_description": "1xDay, forbidden action: Persuasion or Use the Force vs Will Def.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "archaic_ship_s",
        "name": "Archaic Ship",
        "source_book": "S",
        "page": 62,
        "applies_to_type": "Vehicle",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "An archaic ship is one from a much earlier era of technology. Despite potentially having all the same basic technology as modern vessels (laser cannons, shields, hyper drives, and so on). an archaic ship suffers some disadvantages when facing vessels from higher levels of technology. The archaic ship template can also be used to represent a starship built by a culture whose technology is less developed than the galactic norm.\nEven extremely ancient starships can be sufficiently upgraded that they no longer suffer the disadvantages of the archaic template. This requires 1 week of work x the ship's cost modifier and credits equal to 1/10 the ship's original cost. For each week of work, you must succeed on a DC 25 Mechanics check, or that week's effort is lost. If multiple characters work on upgrading an archaic ship, divide the total time required by the number of characters who succeed on the Mechanics check.\nMODIFICATIONS All the modifications for the archaic ship template apply only when the ship is in combat with modern starships. If two archaic ships engage in combat, ignore all changes made by this template.\nCL: The CL of an archaic ship is 2/3 its normal value.\nThreshold: Against modern weapons, an archaic ship has only half its normal damage threshold.\nSR: Any time the SR value of an archaic ship's shields is exceeded, there is a 50% chance they fail entirely. They may be recharged normally.\nWeapons: The weapons of an archaic ship can't score critical hits against nonarchaic vessels.\nAll attack rolls made by archaic ships against modern vessels take a -2 penalty, since older scanners have difficulty tracking modern ships.\nCost: Archaic ships generally can be obtained on the black market for 50% of their original cost.",
        "modifications_summary_text": "CL 2/3; Any time the SR exceeded, there is a 50% chance they fail",
        "structured_modifications": [
          {
            "text_description": "CL 2/3",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          },
          {
            "text_description": "Any time the SR exceeded, there is a 50% chance they fail",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "arkanian_manufacture_k",
        "name": "Arkanian Manufacture",
        "source_book": "K",
        "page": 76,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "Developed on the frozen tundra world of Arkania, weapons and armor of Arkanian manufacture are engineered to function in extremely cold environments. Arkanian weapons deal energy and fire damage (see \"Fire\" on page 255 of the Saga Edition core rulebook); however, if an Arkanian weapon is used with an ability that consumes more than one shot in a round (such as Rapid Shot or Double Attack) the weapon overheats and cannot be fired for one round as it cools down.\nArkanian armor doubles its equipment bonus to Fortitude Defense against cold weather hazards, but has no equipment bonus to Fortitude Defense • against heat-based hazards. Arkanian items cost 10% or 1,000 credits (whichever is higher) more than other items of their kind.\nRestrictions: This template can be applied only to armor or to ranged energy weapons.",
        "modifications_summary_text": "Ranged energy weapon: Energy & Fire DMG. \n>1 shot in 1 round overheats weap 1 round\nArmor: x2 Fort Def vs cold and nullifies Fort Def vs heat",
        "structured_modifications": [
          {
            "text_description": "Ranged energy weapon: Energy & Fire DMG. \n>1 shot in 1 round overheats weap 1 round\nArmor: x2 Fort Def vs cold and nullifies Fort Def vs heat",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "bomarr_monk_r",
        "name": "B'omarr Monk",
        "source_book": "R",
        "page": 56,
        "applies_to_type": "Sentient",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "The B'omarr monks are members of a religious order on Tatooine that believes that the mind can be expanded to reach a state of enlightenment, which requires a withdrawal from all physical sensation. Once a monk has attained enlightenment, the order removes the brain from the enlightened monk's body and places it in a preserving container attached to a BT-16 perimeter security droid. Attachment to the BT-16 gives the enlightened monk mobility without the necessity of a mortal body. Enlightened B'omarr monks use telepathic commands to interface with their droids' processors and command the droids.\nTo convert a BT-16 perimeter security droid's statistics to the statistics of an enlightened B'omarr monk, make the following changes: \n• Remove the heavy repeating blaster. \n• Increase the droid's Intelligence, Wisdom, and Charisma to 18. \n• Replace the Burst Fire feat with the Force Sensitivity feat. \n• Replace the Blast Back talent with the Acute Senses talent.",
        "modifications_summary_text": null,
        "structured_modifications": []
      },
      {
        "id": "baktoid_combat_automata_sgd",
        "name": "Baktoid Combat Automata",
        "source_book": "SGD",
        "page": 16,
        "applies_to_type": "Droid",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Baktoid Combat Automata is part of the extensive Baktoid family of companies. In factories scattered across the galaxy, Baktoid builds untold numbers of battle droids in the years prior to and during the Clone Wars, supplying droids to the Trade Federation and to the Separatists. Baktoid earns a reputation for producing cheap, substandard battle droids thanks to its inferior B1 unit. Other models lack the B1's flaws, but Baktoid's standard designs still suffer from lesser processors and inhibited analytical thinking. After the Separatists' defeat, the Empire shuts down Baktoid. Most of its factories are dismantled, destroyed, nationalized, or taken over by other companies.\nTraits: Baktoid units suffer from inferior processors and remote data links. A character can make a Persuasion check opposed by a Baktoid droid's Perception skill to attempt to temporarily confuse it with contradictory data or brash, seemingly illogical action. If the check is successful, the droid can take no action for one round as it tries to find an appropriate response. If the Persuasion check is unsuccessful, the droid recognizes the ruse and proclaims it loudly while taking an immediate swift action as a reaction.",
        "modifications_summary_text": "Droid confused with Persuasion vs Perception.\nCannot act in 1 round. If failed, it reacts with a swift action.",
        "structured_modifications": [
          {
            "text_description": "Droid confused with Persuasion vs Perception.\nCannot act in 1 round. If failed, it reacts with a swift action.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "balmorran_arms_sgd",
        "name": "Balmorran Arms",
        "source_book": "SGD",
        "page": 16,
        "applies_to_type": "Droid",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Balmorran Arms is best known for providing walkers and other combat vehicles to the military forces of the Galactic Empire. However, it also has an effective combat droid division that is active throughout the years of the Galactic Empire's rule. Balmorran also produces civilian droid models, primarily for use as security units. Some of these units are highly specialized and find success in the years of the Clone Wars, because people throughout the galaxy feel threatened by the war and the associated increase in deep space piracy. The company's SD-model battle droids are a cornerstone of the military forces of the reborn Emperor years after the Battle of Endor. However, Balmorran Arms is tied directly to the Balmorran government and, therefore, is embroiled in the planet's political gamesmanship. The company ultimately supplies both the resurgent Empire and the New Republic at various times during the reborn Emperor's resurgence.\nTraits: Balmorran droid models undergo constant revision and upgrades, so one year's model is rarely the same as the previous year's. When creating or purchasing a new Balmorran Arms droid, increase one ability score by 1.",
        "modifications_summary_text": "+1 in one ability score",
        "structured_modifications": [
          {
            "text_description": "+1 in one ability score",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "baragwin_weapon_k",
        "name": "Baragwin Weapon",
        "source_book": "K",
        "page": 78,
        "applies_to_type": "Weapon",
        "availability_modification": {
          "text_original": "Illegal",
          "set_to": "Illegal",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "Weapons manufactured by the Baragwin can be nasty, because the species has perfected the creation of deadly weapons through centuries of serving as galactic arms dealers. On a successful critical hit, Baragwin weapons grant their wielders + 1 die of damage (after multiplying for the critical hit). However, Baragwin weapons are considered illegal. Baragwin weapons cost 10% or 1,000 credits (whichever is higher) more than the base item.\nRestrictions: None.",
        "modifications_summary_text": "On crit, +1d DMG after doubling for crit.",
        "structured_modifications": [
          {
            "text_description": "On crit, +1d DMG after doubling for crit.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "bonadan-alloy_armor_k",
        "name": "Bonadan-Alloy Armor",
        "source_book": "K",
        "page": 80,
        "applies_to_type": "Armor",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "Although weapons are illegal on the crowded world of Bonadan, armor crafted from a unique alloy created on that planet is second to none. Bonadan-alloy armor provides DR 2 against slashing damage, but any equipment bonus to Fortitude Defense provided by the armor is reduced by one (to a minimum of +0). Bonadan-alloy armor costs 10% or 1,000 credits (whichever is higher) more than the base item.\nRestrictions: This template can be applied only to a suit of armor that provides an equipment bonus to Fortitude Defense.",
        "modifications_summary_text": "On armor that apply equipment bonus to FORT DEF:\nDR2 vs slashing.\nFORT DEF bonus -1 (min 0)",
        "structured_modifications": [
          {
            "text_description": "On armor that apply equipment bonus to FORT DEF:\nDR2 vs slashing.\nFORT DEF bonus -1 (min 0)",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "borg_construct_gw",
        "name": "Borg Construct",
        "source_book": "GW",
        "page": 49,
        "applies_to_type": "Cybernetics",
        "availability_modification": {
          "text_original": "Restricted",
          "set_to": "Restricted",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "80000 + 70000 surgery",
          "options": [
            {
              "type": "text_description",
              "description": "80000 + 70000 surgery"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Borg Construct\nThe BioTech Borg Construct Aj\"6 provides a direct cabled or wireless link to computers and networks within a 10-meter range. It allows a cyborg to remotely program and access on-board data through thought alone. The standard model has a built-in cyborg/droid interface and up to four BioTech Knowledge Cartridge or standard datacard ports (at 500 credits per port beyond the first). Knowledge Cartridges use proprietary technology to achieve Intelligence 4 (instead of Intelligence 2 for a standard datacard), cost 100 credits each, and are not widely available. Installation is described at the Cybernetic Surgery feat; the unit cannot be self-installed.\nCharacters wearing the unit gain a +2 beneficial circumstance bonus to Use Computer, Knowledge, and other skills at the discretion of the Gamemaster. They can also use Issue Routine Commands as a swift action (or as a free action if they have the Gimmick talent). Wearers become more computerlike and less able to relate to people, causing them to take a -5 penalty to all Persuasion checks. They also speak less frequently as they grow accustomed to the speed of communicating through electronic networks.",
        "modifications_summary_text": "Rejection +14; wireless link 10 sq, +2 Use Comp & Knowledge or other, Issue Routine Commands as swif or free with Gimmick, -5 Persuasion",
        "structured_modifications": [
          {
            "text_description": "Rejection +14",
            "target_stat": "Rejection",
            "change_type": "additive_amount",
            "value": 14
          },
          {
            "text_description": "wireless link 10 sq, +2 Use Comp & Knowledge or other, Issue Routine Commands as swif or free with Gimmick, -5 Persuasion",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "borg_construct_datacard_know_cart_port_gw",
        "name": "Borg Construct Datacard/Know cart port",
        "source_book": "GW",
        "page": 49,
        "applies_to_type": "Cybernetics",
        "availability_modification": {
          "text_original": "Restricted",
          "set_to": "Restricted",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "500*",
          "options": [
            {
              "type": "text_description",
              "description": "500*"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Borg Construct\nThe BioTech Borg Construct Aj\"6 provides a direct cabled or wireless link to computers and networks within a 10-meter range. It allows a cyborg to remotely program and access on-board data through thought alone. The standard model has a built-in cyborg/droid interface and up to four BioTech Knowledge Cartridge or standard datacard ports (at 500 credits per port beyond the first). Knowledge Cartridges use proprietary technology to achieve Intelligence 4 (instead of Intelligence 2 for a standard datacard), cost 100 credits each, and are not widely available. Installation is described at the Cybernetic Surgery feat; the unit cannot be self-installed.\nCharacters wearing the unit gain a +2 beneficial circumstance bonus to Use Computer, Knowledge, and other skills at the discretion of the Gamemaster. They can also use Issue Routine Commands as a swift action (or as a free action if they have the Gimmick talent). Wearers become more computerlike and less able to relate to people, causing them to take a -5 penalty to all Persuasion checks. They also speak less frequently as they grow accustomed to the speed of communicating through electronic networks.",
        "modifications_summary_text": "*after the first",
        "structured_modifications": [
          {
            "text_description": "*after the first",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "borg_construct_knowledge_cartridge_gw",
        "name": "Borg Construct Knowledge cartridge",
        "source_book": "GW",
        "page": 49,
        "applies_to_type": "Cybernetics",
        "availability_modification": {
          "text_original": "Restricted",
          "set_to": "Restricted",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "100",
          "options": [
            {
              "type": "fixed_amount",
              "value": 100
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Borg Construct\nThe BioTech Borg Construct Aj\"6 provides a direct cabled or wireless link to computers and networks within a 10-meter range. It allows a cyborg to remotely program and access on-board data through thought alone. The standard model has a built-in cyborg/droid interface and up to four BioTech Knowledge Cartridge or standard datacard ports (at 500 credits per port beyond the first). Knowledge Cartridges use proprietary technology to achieve Intelligence 4 (instead of Intelligence 2 for a standard datacard), cost 100 credits each, and are not widely available. Installation is described at the Cybernetic Surgery feat; the unit cannot be self-installed.\nCharacters wearing the unit gain a +2 beneficial circumstance bonus to Use Computer, Knowledge, and other skills at the discretion of the Gamemaster. They can also use Issue Routine Commands as a swift action (or as a free action if they have the Gimmick talent). Wearers become more computerlike and less able to relate to people, causing them to take a -5 penalty to all Persuasion checks. They also speak less frequently as they grow accustomed to the speed of communicating through electronic networks.",
        "modifications_summary_text": "Int 4",
        "structured_modifications": [
          {
            "text_description": "Int 4",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "bothan_weapon_k",
        "name": "Bothan Weapon",
        "source_book": "K",
        "page": 78,
        "applies_to_type": "Weapon",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "Bothan society is well known for its penchant for espionage, and the Bothans have developed methods of subduing targets without killing them. Bothan weapons deal +1 die of damage when set to stun or when dealing ion damage, but deal -1 die of damage when not set to stun or dealing ion damage. Bothan weapons cost 10% or 1,000 credits (whichever is higher) more than the base item.\nRestrictions: This template can be applied only to weapons that deal stun damage or ion damage.",
        "modifications_summary_text": "Stun or ion DMG weapons:\n+1d DMG when set to stun or doing ion DMG\n-1d DMG when when not set to stun or doing ion DMG",
        "structured_modifications": [
          {
            "text_description": "Stun or ion DMG weapons:\n+1d DMG when set to stun or doing ion DMG\n-1d DMG when when not set to stun or doing ion DMG",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "bronzium_cast_armor_k",
        "name": "Bronzium Cast Armor",
        "source_book": "K",
        "page": 80,
        "applies_to_type": "Armor",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "An extremely solid and durable metal, bronzium can be used in the production of armor that can protect the wearer from suffering great harm. Once per encounter, the wearer of bronzium cast armor can redirect the damage from a successful incoming attack to the armor; the armor takes the damage from the attack (armor has the same DR, hit points, damage threshold, and break DC as a weapon of the same size category as the wearer). If the armor is disabled or destroyed, it no longer provides any bonuses to the wearer. A suit of armor pushed down the condition track imposes its condition penalties to the wearer's Reflex Defense only. Bronzium cast armor costs 10% or 1,000 credits (whichever is higher) more than the base item.\nRestrictions: None.",
        "modifications_summary_text": "Optional; armor take DMG from 1 hit, 1 time per encounter.\nDR, HP, TH & break DC equals weapon of same size category as wearer. If conditiontrack is reduced, penalties apply to wearers REF DEF only.",
        "structured_modifications": [
          {
            "text_description": "Optional",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          },
          {
            "text_description": "armor take DMG from 1 hit, 1 time per encounter.\nDR, HP, TH & break DC equals weapon of same size category as wearer. If conditiontrack is reduced, penalties apply to wearers REF DEF only.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "chrystalis_beast_j",
        "name": "Chrystalis Beast",
        "source_book": "J",
        "page": 133,
        "applies_to_type": "Sentient",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "To create a chrysalis beast, make the following changes to an existing creature (referred to as the base creature).\nChallenge Level: Increase the base creature's CL by 2.\nSize : Increase the size of the base creature by one size category. Adjust the creature 's Strength, Constitution, Reflex Defense, Stealth skill modifier, damage threshold, and carrying capacity accordingly, based on Table 16-2: Size Modifiers on page 274 of the Saga Edition core rulebook. If the base creature is Colossal, its size category remains Colossal; however, increase its Strength and Constitution by 8 and its damage threshold by 50, and double its height or length.\nHit Points: Increase the base creature's hit points by 25%.\nDamage Reduction: Increase the base creature's DR by 4 or to 10, whichever is higher.\nSpeed: Increase all of the creature's speeds by 2 squares.\nFighting Space: Increase the base creature's fighting space based on its adjusted size: Large, 2x2; Huge, 3x3; Gargantuan, 4x4; Colossal, 6x6.\nReach: Increase the creature's reach by 1 square.\nSpecial Qualities: The chrysalis beast gains the following special qualities.\nVicious Natural Weapons: Each of the base creature's natural weapons deals an extra die of damage.\nTerrifying Presence: Any enemy that starts its turn within 6 squares of one or more chrysalis beasts takes a -2 penalty on attack rolls. This is a\nfear effect.",
        "modifications_summary_text": "CL+2; Size+1; hp+25%; DR+4 or DR 10; Speed+2; Reach+1; Vicious Natural Weapons; Terrifying Presence",
        "structured_modifications": [
          {
            "text_description": "CL+2",
            "target_stat": "Cl",
            "change_type": "additive_amount",
            "value": 2
          },
          {
            "text_description": "Size+1",
            "target_stat": "Size",
            "change_type": "additive_amount",
            "value": 1
          },
          {
            "text_description": "hp+25%",
            "target_stat": "Hit Points",
            "change_type": "percentage_delta",
            "value": 0.25
          },
          {
            "text_description": "DR+4 or DR 10",
            "target_stat": "Dr",
            "change_type": "additive_amount",
            "value": 4
          },
          {
            "text_description": "Speed+2",
            "target_stat": "Speed",
            "change_type": "additive_amount",
            "value": 2
          },
          {
            "text_description": "Reach+1",
            "target_stat": "Reach",
            "change_type": "additive_amount",
            "value": 1
          },
          {
            "text_description": "Vicious Natural Weapons",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          },
          {
            "text_description": "Terrifying Presence",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "cinnagaran_manufacture_k",
        "name": "Cinnagaran Manufacture",
        "source_book": "K",
        "page": 76,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "Cinnagaran items are manufactured on the sprawling metropolis world of Empress Teta, which has been at the center of galactic wars for over a thousand years. Cinnagaran armor and shields grant DR 5 against weapons that deal sonic damage, but its Maximum Dexterity Bonus is reduced by 1.\nCinnagaran weapons deal energy and bludgeoning damage. Cinnagaran items cost 10% or 1,000 credits (whichever is higher) more than other items of their kind.\nRestrictions: This template can be applied only to armor or to ranged energy weapons.",
        "modifications_summary_text": "Ranged energy weapon: Energy & Bludgeoning DMG\nArmor: DR5 vs sonic damage, max dex -1.",
        "structured_modifications": [
          {
            "text_description": "Ranged energy weapon: Energy & Bludgeoning DMG\nArmor: DR5 vs sonic damage, max dex -1.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "colicoid_creation_nest_sgd",
        "name": "Colicoid Creation Nest",
        "source_book": "SGD",
        "page": 16,
        "applies_to_type": "Droid",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "The Colicoid Creation Nest manufactures all the Colicoids' high-technology products, such as droids, vehicles, weapons, and equipment. As might be expected from the products of such a vicious and violent species, Colicoid battle droids are among the galaxy's toughest and most ruthless automatons. During the Clone Wars, the Colicoids supply droidekas, tri-fighters, and buzz droids to the Separatist forces, while retaining even more powerful models for defense of their homeworld. The end of the Clone Wars shuts down the Colicoids' droid export business, but the nest continues to build the planet's other high-technology goods. Since most beings stay as far from the Colicoids' violent homeworld as possible, few actively seek out their services or models. However, brave or foolhardy traders risk obtaining highly customized droids or batches of new Colicoid models for specific dealers, crime lords, or collectors-for a large fee.\nTraits: Colicoid droids are vicious and difficult to take down. They are completely fearless and follow orders without question. Once per encounter, a Colicoid droid can ignore all negative penalties from its location on the condition track when making an attack.",
        "modifications_summary_text": "1xEncounter, Ignore a negative condition track.",
        "structured_modifications": [
          {
            "text_description": "1xEncounter, Ignore a negative condition track.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "comlink_subcutaneous_gw",
        "name": "Comlink, subcutaneous",
        "source_book": "GW",
        "page": 49,
        "applies_to_type": "Cybernetics",
        "availability_modification": {
          "text_original": "Restricted",
          "set_to": "Restricted",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "4000 + 3000 surgery",
          "options": [
            {
              "type": "text_description",
              "description": "4000 + 3000 surgery"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Comlink, Subcutaneous\nA subcutaneous comlink features special sensors and transmitters attached to the vocal and auditory organs of the host. This allows the creature with this implant to hear comlink transmissions and to send his or her own by making only slight vocal sounds. When a being with a subcutaneous comlink wishes, he or she can communicate through this comlink without making a sound loud enough for others to hear.",
        "modifications_summary_text": "Rejection +3; hear or send without noise loud enough for others",
        "structured_modifications": [
          {
            "text_description": "Rejection +3",
            "target_stat": "Rejection",
            "change_type": "additive_amount",
            "value": 3
          },
          {
            "text_description": "hear or send without noise loud enough for others",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "cortosis_weave_phrik_alloy_k",
        "name": "Cortosis Weave/Phrik Alloy",
        "source_book": "K",
        "page": 77,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": "Rare outside KOTOR era",
          "set_to": "Rare outside KOTOR era",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+20%",
          "options": [
            {
              "type": "percentage_delta",
              "value": 0.2
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Weapons and armor made of cortosis weave or phrik alloy share a special property that prevents lightsabers from slicing through them with great ease. A lightsaber does not ignore the DR of a weapon or suit of armor made of cortosis weave or phrik alloy. A piece of equipment with this template costs 20% more than the base item.\nDuring this time, almost all melee weapons are coated with a cortosis weave due not only to an abundance of the material but also the presence of large numbers of lightsaber-wielding combatants; as a result, they are not given the Rare availability tag during this era. During other eras, however, these materials are far more difficult to find, and are given the Rare tag as normal.\nRestrictions: None.",
        "modifications_summary_text": "DR vs lightsabers",
        "structured_modifications": [
          {
            "text_description": "DR vs lightsabers",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "name": "Crew Quality",
        "source_book": "CR",
        "page": 174,
        "applies_to_type": "Vehicle",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Rather than providing statistics for every member of a vehicle's crew, most vehicle descriptions provide a general \"crew quality\" descriptor.\nThe following chart lists the five levels of crew quality for GM-controlled vehicle crews, along with the appropriate check modifier. Use the number in the Attack Bonus column for all attack rolls performed by the crew. Use the number in the Check Modifier column for all skill checks related to the operation of the vessel (including Mechanics, Pilot, and Use Computer checks). Crew quality modifies a vehicle's CL, as shown in the CL Modifier column. These modifiers are already included in the vehicle's statistics.\nFor unique vehicles where the crew's statistics are included, this table is unnecessary. All crewmembers of a general crew quality are considered to only have non heroic levels.\nCREW        ATTACK   CHECK        CL \nQUALITY  BONUS   MODIFIER  MODIFIER \nUntrained -5 +0  -1 \nNormal  +0  +5  +0 \nSkilled  +2  +6  +1 \nExpert  +5  +8 +2 \nAce  +10  +12  +4",
        "modifications_summary_text": "Untrained: AB -5 CM +0 CLM -1\nNormal: AB +0 CM +5 CLM +0\nSkilled: AB +2 CM +6 CLM +1\nExpert: AB +5 CM +8 CLM +2\nAce: AB +10 CM +12 CLM +4",
        "structured_modifications": [
          {
            "text_description": "Untrained: AB -5 CM +0 CLM -1\nNormal: AB +0 CM +5 CLM +0\nSkilled: AB +2 CM +6 CLM +1\nExpert: AB +5 CM +8 CLM +2\nAce: AB +10 CM +12 CLM +4",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "cybernetic_prosthesis_cr",
        "name": "Cybernetic prosthesis",
        "source_book": "CR",
        "page": 136,
        "applies_to_type": "Sentient",
        "availability_modification": {
          "text_original": "Licensed",
          "set_to": "Licensed"
        },
        "cost_modification": {
          "text_original": "1500 + 500 surgery",
          "options": [
            {
              "type": "text_description",
              "description": "Base cost 1500cr for prosthesis, plus 500cr for surgery."
            }
          ]
        },
        "full_text_description": "Prosthetic replacements in the Star Wars universe frequently take the form of mechanical simulations powered by tiny high-capacity battery packs and motivated by the recipient's bioelectrical impulses. Attaching a cybernetic prosthesis requires the Cybernetic Surgery feat. Once attached, the cybernetic replacement performs as well as the original limb or extremity. Unlike other creatures, a creature with cybernetic prosthetics takes full damage from weapons and attacks that deal ion damage. Because the Force is present in all living things, but not machines, creatures with cybernetic prosthetics take a -1 penalty on Use the Force checks for each prosthetic replacement (to a maximum penalty of -5).",
        "modifications_summary_text": "Takes full damage from ion weapons. -1 penalty on Use the Force checks per prosthetic (max -5).",
        "structured_modifications": [
          {
            "target_stat": "Damage Taken (Ion)",
            "change_type": "text_rule",
            "notes": "Takes full damage from ion weapons."
          },
          {
            "target_stat": "Use the Force Check Penalty",
            "change_type": "decrease_by_fixed",
            "value": 1,
            "condition": "per prosthetic",
            "notes": "Maximum penalty of -5."
          }
        ]
      },
      {
        "name": "Cybernetic prosthesis",
        "source_book": "GW",
        "page": 49,
        "applies_to_type": "Cybernetics",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "1500 + 500 surgery",
          "options": [
            {
              "type": "text_description",
              "description": "1500 + 500 surgery"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Cybernetic Prosthesis\nProsthetic replacements in the Star Wars universe frequently take the form of mechanical simulations powered by tiny high-capacity battery packs and motivated by the recipient's bioelectrical impulses. In effect, someone who loses a limb or an extremity can have an electronic replacement that acts (and in some cases looks) just like the original.\nCybernetic prosthetic devices are unusual, but hardly rare. Luke Skywalker gains a cybernetic replacement for his right hand, lost in battle against Darth Vader-who, in turn, had much of his own body replaced with cybernetics years before.\nAttaching a cybernetic prosthesis requires the Cybernetic Surgery feat (see page 83). Once attached, the cybernetic replacement performs as well as the original limb or extremity. Common cybernetic prosthetics include arms, hands, legs, feet, and various internal organs. In addition to the cost of the prosthesis, the recipient must also cover the cost of the surgery (see Table 8-9: Services and Expenses, page 141).\nUnlike other creatures, a creature with cybernetic prosthetics takes full damage from weapons and attacks that deal ion damage.\nBecause the Force is present in all living things, but not machines, creatures with cybernetic prosthetics take a -1 penalty on Use the Force checks for each prosthetic replacement (to a maximum penalty of -5).",
        "modifications_summary_text": null,
        "structured_modifications": []
      },
      {
        "id": "cyborg_hybrid_gw",
        "name": "Cyborg Hybrid",
        "source_book": "GW",
        "page": 50,
        "applies_to_type": "Sentient",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "On rare occasions, a character can be so severely injured that most of his or her body is beyond recovery, yet essential organs-such as the brain, heart, and lungs-still function . In some of these cases, a risky technique known as total cyborg replacement can be used to preserve the wounded character. This replaces nearly all of the character's body with cybernetic replacements, leaving a mechanical shell around a few preserved organs. General Grievous is the most famous example of a total-replacement cyborg , but Darth Vader's injuries were so extensive that he, too, could be considered a total-replacement cyborg.\nWhen you would normally die, you can spend a Destiny Point to preserve enough of yourself for placement in a total-replacement cyborg body. Your allies must transport you somewhere capable of performing the delicate surgery, and a cybernetic surgeon must complete the changeover surgery, which is identical to installing 6 cybernetic prostheses. Once the process begins, al l 6 must be installed consecutively without pause. If any of the surgeries fail s, you die. If all succeed, you are returned to life exactly as before, but now have 6 cybernetic prostheses and gain the Cyborg Hybrid special quality described below. You should work with your Gamemaster to determine your new appearance, which should be drastically different from your appearance before near-death.\nCyborg Hybrid-As a cyborg hybrid, you can use any type of droid system except a processor. Your cyborg hybrid chassis includes a life support system, making you immune to atmospheric and inhaled poison hazards.",
        "modifications_summary_text": "When you normally would die, spend a DP, get 6 cybernetic prostheses installed successfully. Can use any droid system except processor; immune to atmospheric and inhaled poisons",
        "structured_modifications": [
          {
            "text_description": "When you normally would die, spend a DP, get 6 cybernetic prostheses installed successfully. Can use any droid system except processor",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          },
          {
            "text_description": "immune to atmospheric and inhaled poisons",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "cybot_galactica_sgd",
        "name": "Cybot Galactica",
        "source_book": "SGD",
        "page": 16,
        "applies_to_type": "Droid",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Cybot Galactica dominates the nonmilitary droid market, excelling in both design and marketing. Although its prices match its prestige, Cybot Galactica's customer service and repair service span the galaxy. All major and most lesser Republic and Imperial worlds hold at least one official Cybot sales and service center. Cybot is a major player in the Corporate Sector and wields considerable political influence in the Core Worlds as well. Cybot utilizes Telti facilities as well as those on the planet Affa for its protocol division.\nTraits: Cybot systems are so commonplace that nondroid heroes with Skill Focus (Mechanics) can modify or repair Cybot droids in half the time that would be required for a normal droid (see page 197 of the Saga Edition core rulebook). This does not stack with any other ability that saves modification or repair time. A droid does not gain this benefit when modifying itself.",
        "modifications_summary_text": "Repairs at half time with Skill Focus(Mechanics). \nDoesn't stack with other timesaving bonuses.\nDoesn't apply when droid modifies itself.",
        "structured_modifications": [
          {
            "text_description": "Repairs at half time with Skill Focus(Mechanics). \nDoesn't stack with other timesaving bonuses.\nDoesn't apply when droid modifies itself.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "czerka_corporation_sgd",
        "name": "Czerka Corporation",
        "source_book": "SGD",
        "page": 16,
        "applies_to_type": "Droid",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Originally operating as Czerka Mining and Industrial in the time of the Old Republic, Czerka Corporation has produced droids and innumerable other products for thousands of years. During the Old Republic, Czerka Corporation is an early major player in both the combat-droid and service-droid markets. By the rise of the Empire, Czerka still produces sophisticated droids and computer systems, but no longer dominates that market because of its shift to arms manufacturing.\nTraits: Czerka droid designs are exceptionally personable, no matter their degree or designed purpose. Even the feared HK assassin droids have a certain frightening charm. A Czerka droid can use its Intelligence or Wisdom modifier instead of its Charisma modifier to determine its Persuasion skill modifier.",
        "modifications_summary_text": "May use INT bonus instead of CHA bonus on persuasion checks.",
        "structured_modifications": [
          {
            "text_description": "May use INT bonus instead of CHA bonus on persuasion checks.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "dark_side_spirit_j",
        "name": "Dark Side Spirit",
        "source_book": "J",
        "page": 118,
        "applies_to_type": "Sentient",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": null,
        "modifications_summary_text": null,
        "structured_modifications": []
      },
      {
        "id": "dashade_weapon_k",
        "name": "Dashade Weapon",
        "source_book": "K",
        "page": 79,
        "applies_to_type": "Weapon",
        "availability_modification": {
          "text_original": "Illegal",
          "set_to": "Illegal",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "The Dashade species specializes in creating weapons capable of inflicting great pain-if not great damage-upon an opponent. A target moved down the condition track by an attack from a Dashade weapon can only spend 2 swift actions per turn to recover. This effect lasts until the target returns to its normal state (all conditions removed). Dashade weapons are considered Illegal, and take a -2 penalty to damage rolls. Dashade weapons cost 10% or 1,000 credits (whichever is higher) more than the base item.\nRestrictions: None.",
        "modifications_summary_text": "DMG -2. Opponent moved down CT can only use max 2 swift per turn to recover.",
        "structured_modifications": [
          {
            "text_description": "DMG -2. Opponent moved down CT can only use max 2 swift per turn to recover.",
            "target_stat": "Dmg",
            "change_type": "subtractive_amount",
            "value": 2
          }
        ]
      },
      {
        "id": "durasteel_cast_armor_k",
        "name": "Durasteel Cast Armor",
        "source_book": "K",
        "page": 80,
        "applies_to_type": "Armor",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "A thin and lightweight metal, durasteel is used in the construction of armor when extra protection is needed. Durasteel cast armor grants DR 1 to the wearer, but any equipment bonus to Fortitude Defense provided by the armor is reduced by one (to a minimum of +0). Durasteel cast armor costs 100,b or 1,000 credits (whichever is higher) more than the base item.\nRestrictions: This template can be applied only to a suit of armor that provides an equipment bonus to Fortitude Defense.",
        "modifications_summary_text": "On armor that apply equipment bonus to FORT DEF:\nDR +1, FORT DEF bonus -1 (min 0)",
        "structured_modifications": [
          {
            "text_description": "On armor that apply equipment bonus to FORT DEF:\nDR +1, FORT DEF bonus -1 (min 0)",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "duwani_mechanical_products_sgd",
        "name": "Duwani Mechanical Products",
        "source_book": "SGD",
        "page": 16,
        "applies_to_type": "Droid",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Operating 4,000 years before the rise of the Empire, Duwani Mechanical Products is among the more successful droid manufacturers of the Old Republic. Duwani products span the range of the droid market, including service droids and early battle droids. Duwani's droids are durable and rugged-looking. Although elegant models exist, Duwani's design style is utilitarian and minimalist. Duwani battle droids fight for the Old Republic, and its service and protocol droids are commonly found at Republic and commercial facilities around the galaxy. The reliability of its units and its superior customer service make Duwani a major competitor of Czerka Corporation in the droid market.\nTraits: Once per encounter, when it has half or fewer of its maximum hit points, as a reaction, a Duwani droid can either gain 5 bonus hit points or add 5 to its damage threshold for one round.",
        "modifications_summary_text": "1xEncounter. If /2 or fewer hitpoints, +5hp or +5 threshold for 1r.",
        "structured_modifications": [
          {
            "text_description": "1xEncounter. If /2 or fewer hitpoints, +5hp or +5 threshold for 1r.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "echani_manufacture_k",
        "name": "Echani Manufacture",
        "source_book": "K",
        "page": 77,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "Extremely rare, items of Echani manufacture are hand-crafted by the powerful and skilled Echani warriors, and each individual item is unique. Echani armor weighs half as much as other armor of its kind, and once per encounter the wearer can move at their normal speed (not the adjusted speed for wearing the armor) for one round, though the armor's bonus to Reflex Defense is reduced by 1.\nOnce per encounter the wielder of an Echani weapon can declare that the critical range of his weapon is increased by one (thus scoring a critical on a 19 or a 20 on most weapons). However, any roll other than a natural 20 is not considered an automatic hit, and if you still miss the target you do not score a critical hit. The use of this ability can be declared after the attack roll is made, but before the attack is resolved. However, Echani weapons have half as many hit points as other weapons of their kind. Echani-manufactured items cost 10% or 1,000 credits (whichever is higher) more than the base item.\nRestrictions: This template can be applied only to armor or to weapons that deal slashing or piercing damage (no lightsabers).",
        "modifications_summary_text": "Slashing/piercing weapon (not lightsabers): Increase critical threat range by 1 once per encounter. Only 20 is automatic hit. Can be declared after attack is made. /2 HP.\nArmor: /2 weight, move full movement 1 time per encounter as if wearing no armor. -1 bonus to REF DEF.",
        "structured_modifications": [
          {
            "text_description": "Slashing/piercing weapon (not lightsabers): Increase critical threat range by 1 once per encounter. Only 20 is automatic hit. Can be declared after attack is made. /2 HP.\nArmor: /2 weight, move full movement 1 time per encounter as if wearing no armor. -1 bonus to REF DEF.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "environmental_bastion_armor_k",
        "name": "Environmental Bastion Armor",
        "source_book": "K",
        "page": 80,
        "applies_to_type": "Armor",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "Environmental bastion armors are designed to protect the wearer from harsh environments-including vacuum-and provide a comfortable environment for whatever species they are made for (for example, Ubese wear environmental bastion armor that produces atmosphere similar to their homeworld's). Environmental bastion armor acts as a sealed environment suit, providing a number of hours of breathable air to the wearer equal to the armor's equipment bonus to Fortitude Defense. Environmental bastion armor costs 10% more than the base item.\nRestrictions: This template can be applied only to a suit of armor that provides an equipment bonus to Fortitude Defense.",
        "modifications_summary_text": "On armor that apply equipment bonus to FORT DEF:\nProvides breathable air equal to armor's FORT DEF bonus.",
        "structured_modifications": [
          {
            "text_description": "On armor that apply equipment bonus to FORT DEF:\nProvides breathable air equal to armor's FORT DEF bonus.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "eriadun_armor_k",
        "name": "Eriadun Armor",
        "source_book": "K",
        "page": 80,
        "applies_to_type": "Armor",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "Crafted on the Human-dominated world of Eriadu, Eriadun armor helps soldiers avoid being taken prisoner and interrogated by enemy forces. A suit of Eriadun armor or an Eriadun energy shield provides DR 5 against stun damage, but any equipment bonus to Fortitude Defense provided by the armor is reduced by one (to a minimum of +0). Eriadun armor costs 10% or 1,000 credits (whichever is higher) more than the base item.\nRestrictions: This template can be applied only to a suit of armor that provides an equipment bonus to Fortitude Defense.",
        "modifications_summary_text": "On armor that apply equipment bonus to FORT DEF:\nDR5 vs stun DMG. FORT DEF bonus -1 (min 0)",
        "structured_modifications": [
          {
            "text_description": "On armor that apply equipment bonus to FORT DEF:\nDR5 vs stun DMG. FORT DEF bonus -1 (min 0)",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "eye_infrared_sensor_gw",
        "name": "Eye, infrared sensor",
        "source_book": "GW",
        "page": 49,
        "applies_to_type": "Cybernetics",
        "availability_modification": {
          "text_original": "Restricted",
          "set_to": "Restricted",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "300 + 2250 surgery",
          "options": [
            {
              "type": "text_description",
              "description": "300 + 2250 surgery"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Eye, Infrared Sensor\nThis cybernetic replacement eye includes special infrared sensors that allow the host to see not only visible light but also heat signatures. This grants the host darkvision.",
        "modifications_summary_text": "Rejection +14 vs. Fort; grants darkvision",
        "structured_modifications": [
          {
            "text_description": "Rejection +14 vs. Fort",
            "target_stat": "Rejection",
            "change_type": "additive_amount",
            "value": 14
          },
          {
            "text_description": "grants darkvision",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "eye_targeting_gw",
        "name": "Eye, targeting",
        "source_book": "GW",
        "page": 49,
        "applies_to_type": "Cybernetics",
        "availability_modification": {
          "text_original": "Military",
          "set_to": "Military",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "500 + 3750 surgery",
          "options": [
            {
              "type": "text_description",
              "description": "500 + 3750 surgery"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Eye, Targeting\nThis cybernetic replacement eye includes enhanced target-recognition software linked with weapon packages and armor targeting packages. The eye creates HUD overlays, augmenting the host's vision to enhance combat prowess. A host with a targeting eye is considered to have the benefit of a helmet package (see page 140 of the Saga Edition core rulebook).",
        "modifications_summary_text": "Rejection +16 vs. Fort; Perception +2, low-light vision",
        "structured_modifications": [
          {
            "text_description": "Rejection +16 vs. Fort",
            "target_stat": "Rejection",
            "change_type": "additive_amount",
            "value": 16
          },
          {
            "text_description": "Perception +2, low-light vision",
            "target_stat": "Perception",
            "change_type": "additive_amount",
            "value": 2
          }
        ]
      },
      {
        "id": "eye_telescopic_gw",
        "name": "Eye, telescopic",
        "source_book": "GW",
        "page": 49,
        "applies_to_type": "Cybernetics",
        "availability_modification": {
          "text_original": "Restricted",
          "set_to": "Restricted",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "500 + 3750 surgery",
          "options": [
            {
              "type": "text_description",
              "description": "500 + 3750 surgery"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Eye, Telescopic\nA telescopic replacement eye can zoom in on remote objects, granting the bearer a greater range of distant vision. In some cases this is just a result of visual enhancement software and fine-tuned sensors, but in other cases this can mean that the eye literally detaches from the host and hovers on tiny repulsors closer to the target. A telescopic eye replacement allows the host to take range penalties to Perception checks every 20 squares instead of every 10 squares.",
        "modifications_summary_text": "Rejection +9 vs. Fort; range penalties to perception every 20 sq not 10",
        "structured_modifications": [
          {
            "text_description": "Rejection +9 vs. Fort",
            "target_stat": "Rejection",
            "change_type": "additive_amount",
            "value": 9
          },
          {
            "text_description": "range penalties to perception every 20 sq not 10",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "gand_weapon_k",
        "name": "Gand Weapon",
        "source_book": "K",
        "page": 79,
        "applies_to_type": "Weapon",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "The Gand species, peculiar and often incomprehensible, specializes in crafting weapons that immobilize opponents. If a Gand weapon moves a target down the condition track with its stun damage, that target has its speed halved until it returns to its normal state (all conditions removed); a target that is -4 steps down the condition track (at the -10 step) is immobilized instead. Gand weapons are sometimes difficult to operate, and all Gand weapons are considered exotic weapons for the purposes of proficiency (except to members of the Gand species). Gand weapons cost 10% or 1,000 credits (whichever is higher) more than the base item.\nRestrictions: This template can be applied only to weapons that deal stun damage.",
        "modifications_summary_text": "Weap with stun DMG: If target move down condition, /2 speed until restored. At -4 = immobilized. Exotic except for Gands.",
        "structured_modifications": [
          {
            "text_description": "Weap with stun DMG: If target move down condition, /2 speed until restored. At -4 = immobilized. Exotic except for Gands.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "genoharadan_manufacture_k",
        "name": "GenoHaradan Manufacture",
        "source_book": "K",
        "page": 77,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "A secretive guild of assassins and bounty hunters, the GenoHaradan have items specially crafted to suit their darker purposes. GenoHaradan armor provides a +2 equipment bonus on Stealth checks to sneak but reduces the equipment bonus to Fortitude Defense by one (minimum +0). GenoHaradan weapons grant a +2 equipment bonus to the attack roll of a contact poison applied to the weapon (for melee weapons). or a +1 equipment bonus on attack rolls with weapons set to stun (for ranged weapons). GenoHaradan weapons are somewhat fragile, and become disabled until repaired when the wielder rolls a natural 1 on an attack roll. GenoHaradan-manufactured items cost 10% or 1,000 credits (whichever is higher) more than the base item.\nRestrictions: This template cannot be applied to melee weapons that deal energy damage or to ranged weapons without a stun setting. This template can be applied only to a suit of armor that provides an equipment bonus to Fortitude Defense.",
        "modifications_summary_text": "Energy melee weap: +2 equip bonus to ATK of a contact poison applied to it. Breaks on \"1\".\nRanged (must have stun setting): +1 ATK on stun setting. Breaks on \"1\".\nArmor: +2 stealth, -1 FORT DEF bonus (min 0)",
        "structured_modifications": [
          {
            "text_description": "Energy melee weap: +2 equip bonus to ATK of a contact poison applied to it. Breaks on \"1\".\nRanged (must have stun setting): +1 ATK on stun setting. Breaks on \"1\".\nArmor: +2 stealth, -1 FORT DEF bonus (min 0)",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "halowan_mechanicals_sgd",
        "name": "Halowan Mechanicals",
        "source_book": "SGD",
        "page": 16,
        "applies_to_type": "Droid",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Holowan Mechanicals is best known for developing the IG-Series droids. The IG-Series designs are obtained through the acquisition of assets from Phlut Design Systems by the InterGalactic Banking Clan. During the Clone Wars, the IG-100 MagnaGuards serve prominently as General Grievous's personal bodyguards. However, when developing the IG assassination droid series, Holowan technicians seriously underestimate the lethality of their design, eventually losing the entire team to the escaped prototypes, setting back Holowan as a competitive droid producer for years to come.\nTraits: Holowan units are designed for lethality. Once per encounter, a Holowan droid can add 1 die of damage to an attack.",
        "modifications_summary_text": "1xEncounter, +1d of damage on an attack.",
        "structured_modifications": [
          {
            "text_description": "1xEncounter, +1d of damage on an attack.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "heirloom_extra_modification_l",
        "name": "Heirloom, Extra Modification",
        "source_book": "L",
        "page": 97,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "When an item becomes an heirloom item, the owner can modify the item a second time using the Tech Specialist feat (see page 21 of Starships of the Galaxy).",
        "modifications_summary_text": "can modify a second time with Tech Specialist",
        "structured_modifications": [
          {
            "text_description": "can modify a second time with Tech Specialist",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "heirloom_legendary_icon_l",
        "name": "Heirloom, Legendary Icon",
        "source_book": "L",
        "page": 97,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "When an item becomes an heirloom item, its fame spreads throughout the galaxy. When carrying the heirloom item in plain sight, you gain favorable circumstances on all Charisma - based skill checks (except Use the Force checks) .",
        "modifications_summary_text": "CHA-based skill checks are favorable (except Use the Force)",
        "structured_modifications": [
          {
            "text_description": "CHA-based skill checks are favorable (except Use the Force)",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "heirloom_lightsaber_l",
        "name": "Heirloom, Lightsaber",
        "source_book": "L",
        "page": 97,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "A Force-sensitive character who acquires an heirloom lightsaber can attune himself or herself to the lightsaber, gaining the benefits of the weapon as though he had constructed the weapon originally. The character in possession of the heirloom lightsaber must spend 24 hours meditating over the weapon and spend a Force Point to attune the weapon. From that point on, the character is treated as the weapon's builder and gains the normal bonus for being attuned to the lightsaber; this can only be done with heirloom lightsabers, not other characters' lightsabers.",
        "modifications_summary_text": "force-sensitive can attune himself to lightsaber",
        "structured_modifications": [
          {
            "text_description": "force-sensitive can attune himself to lightsaber",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "heirloom_steeped_in_the_dark_side_l",
        "name": "Heirloom, Steeped in the Dark Side",
        "source_book": "L",
        "page": 97,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "When an item possessed by an agent of evil becomes an heirloom Item, some of its owner's evil becomes infused in the item itself. Once per encounter, while carrying or using the heirloom item, you can apply a destiny bonus equal to one-half your Dark Side Score on anyone attack roll or skill check made before the end of your turn. Applying this bonus increases your Dark Side Score by 1.",
        "modifications_summary_text": "1 per encounter, apply destiny bonus equal to /2 dark side score to ATK roll or skill check before the end of your turn. Gain 1 dark side point.",
        "structured_modifications": [
          {
            "text_description": "1 per encounter, apply destiny bonus equal to /2 dark side score to ATK roll or skill check before the end of your turn. Gain 1 dark side point.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "heirloom_symbol_of_the_light_l",
        "name": "Heirloom, Symbol of the Light",
        "source_book": "L",
        "page": 97,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "When an item possessed by a good person becomes an heirloom Item, It becomes a beacon of light that staves off the darkness. When carrying or using the heirloom item, once per encounter, as a reaction, you can impose a penalty on anyone attack roll or skill check made by a character with a Dark Side Score of 1 or higher. This penalty is equal to the target's Dark Side Score.",
        "modifications_summary_text": "1 per encounter as a reaction, impose a penalty equal to target’s DSS on any one attack roll or skill check made by a character with a DSS of 1+",
        "structured_modifications": [
          {
            "text_description": "1 per encounter as a reaction, impose a penalty equal to target’s DSS on any one attack roll or skill check made by a character with a DSS of 1+",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "imperial_department_of_military_research_sgd",
        "name": "Imperial Department of Military Research",
        "source_book": "SGD",
        "page": 16,
        "applies_to_type": "Droid",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Although not a manufacturer of droids, the Imperial Department of Military Research advances droid design in unusual directions. Rebel leaders learn over the course of the Galactic Civil War that the department is responsible for dark and cunning droid designs, such as interrogation droids and the Dark Trooper project. When a particularly dangerous design is discovered, Rebel agents are dispatched to hinder its development or to destroy the facilities required to build the units.\nTraits: Imperial droids vary greatly in mission and specifications. However, their prototypes are constructed with built-in tracking devices and recording equipment to document the droid's performance. The droids transmit the data upon command to a central reporting station or, when in the field, to the nearest Imperial installation.",
        "modifications_summary_text": "Built in tracking device.",
        "structured_modifications": [
          {
            "text_description": "Built in tracking device.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "industrial_automaton_sgd",
        "name": "Industrial Automaton",
        "source_book": "SGD",
        "page": 16,
        "applies_to_type": "Droid",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "The hugely successful R-Series astromech droids make Industrial Automaton one of the galaxy's more successful droid manufacturers. Industrial Automaton competes with Cybot Galactica in price, product, and service, and its sales and maintenance facilities can be found on any civilized planet with a sufficiently advanced tech level or a major starport. IA's major production lines are on Telti, but it also employs factories throughout the galaxy.\nTraits: Industrial Automaton astromechs can be found in most starports, and technicians are used to working with IA units. When assisting on a Mechanics check, an Industrial Automaton droid trained in Mechanics can add its Intelligence bonus (minimum + 1) to the normal +2 bonus.",
        "modifications_summary_text": "When assisting Skill(Mechanics), add INT bonus on top of the +2.",
        "structured_modifications": [
          {
            "text_description": "When assisting Skill(Mechanics), add INT bonus on top of the +2.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "ion_shielding_gw",
        "name": "Ion Shielding",
        "source_book": "GW",
        "page": 50,
        "applies_to_type": "Cybernetics",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "1000",
          "options": [
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Ion Shielding\nIon shielding is a new cybernetic prosthesis upgrade for the Scum and Villainy upgrade system. It can be added only to a cybernetic prosthesis, and it requires 1 upgrade slot. The upgrade has a cost of 1,000 credits, and when installed it protects the host from ion damage. If all of a creature's cybernetic enhancements have the ion shielding upgrade, the host is not treated as being cybernetically enhanced for the purposes of taking ion damage. However, if even one cybernetic enhancement does not have this shielding, the host gains no benefit.",
        "modifications_summary_text": "Upgrade for cybernetics prostheses only. Protects host from ion damage",
        "structured_modifications": [
          {
            "text_description": "Upgrade for cybernetics prostheses only. Protects host from ion damage",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "iridorian_manufacture_k",
        "name": "Iridorian Manufacture",
        "source_book": "K",
        "page": 77,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": "Illegal",
          "set_to": "Illegal",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "The Iridonians are a mysterious species known for their savagery and aggressiveness. Iridonian armor and shields provide DR 2 against bludgeoning damage. Iridonian weapons gain a +2 equipment bonus to damage rolls when using either the Power Attack or Power Blast feats. However, all Iridonian weapons are considered Illegal, and visibly displaying an Iridonian weapon or wearing Iridonian armor always imposes unfavorable circumstances on Deception or Persuasion checks against law enforcement officials and other authority figures. Iridonian-manufactured items cost 10% or 1,000 credits (whichever is higher) more than the base item.\nRestrictions: None.",
        "modifications_summary_text": "Illegal and unfavorable vs law enforcements/authority (see rules).\nWeapon: +2 equip to DMG rolls with power attack or power blast.\nArmor: +2 vs bludgeoning.",
        "structured_modifications": [
          {
            "text_description": "Illegal and unfavorable vs law enforcements/authority (see rules).\nWeapon: +2 equip to DMG rolls with power attack or power blast.\nArmor: +2 vs bludgeoning.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "junker_s",
        "name": "Junker",
        "source_book": "S",
        "page": 104,
        "applies_to_type": "Vehicle",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "The junker template represents starships (most often fighters and space transports, though a junker capital ship is certainly possible) that are badly put together. Many junkers are older starships that haven't been properly maintained for so long that it's simply not possible to bring them back to fully functional status. Junkers can also represent ships that are poorly designed, making them junkers right off the assembly line.\nJunkers can also be used to represent \"uglies,\" starships constructed from parts of different ship designs. The most common uglies are TYE-wings, which combine the ball cockpit of a TIE fighter with the engines of a Y-wing. TYE-wings are slower than TIEs and lack the increased durability of Y-wings, but because spare parts for those two models are so common, combining them into clunky, ugly hybrid starfighters sometimes makes sense.\nMODIFICATIONS \nCL: Reduce the CL of a junker by 20% (round down). Initiative: Reduce a junker's Initiative by 5 after all other modifications.\nAbilities: Reduce Strength by 4, Dexterity by 2 and Intelligence by 2 (all minimum 10). Recalculate all statistics derived from these abilities' modifiers.\nSystems Failure: A junker is always on the verge of falling apart, and sometimes does so in the middle of combat. Every time a junker moves down -1 step on its condition track, one of its systems fails. A failed system is totally nonfunctional and remains that way until the junker moves back up the condition track. Roll percentile dice to see what system fails (see below). If you roll a system your junker does not have (such as rolling a hyperdrive malfunction on a ship lacking a hyperdrive). simply ignore the result-you got lucky.\nD%   FAILED SYSTEM \n01-30              Hyperdrive \n31-60              Engines (reduce starship-scale speed by 1 square, and character-scale movement by the same percentage) \n61-85              One weapon or weapon battery (determine which randomly) \n86-95              Computer core (-5 to all Perception and Computer Use checks made with the starship's equipment) \n96-100            Shields\nPatchwork: The one benefit of a junker is that its cobbled-together systems are easier to patch back together into the semifunctional state they normally operate in. Reduce the DC of any Mechanics check made on a junker by 2.",
        "modifications_summary_text": null,
        "structured_modifications": []
      },
      {
        "id": "krath_manufacture_k",
        "name": "Krath Manufacture",
        "source_book": "K",
        "page": 77,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "Items created by the Krath typically have a cruel and dangerous twist. Krath armor and shields provide DR 2 against energy damage. If an attack roll with a Krath weapon equals or exceeds the target's Fortitude Defense as well as Reflex Defense, the target takes ld4 damage at the beginning of its next turn. Krath-manufactured items cost 100/0 or 1,000 credits (whichever is higher) more than the base item. However, Krath weapons and armor hold the taint of the dark side within them, and any character wielding a Krath manufacture weapon or wearing Krath armor treat their Dark Side Score as one higher than it actually is for the purposes of being targeted by effects that only affect targets with a Dark Side Score.\nRestrictions: This template can be applied only to armor or to melee weapons that deal slashing or piercing damage, and cannot be applied to lightsabers.",
        "modifications_summary_text": "Dark Side score is treated as +1 when targeted with something that targets dark side.\nSlashing/Piercing melee weap (not lightsaber): If DMG is above targets FORT DEF target take 1d4 DMG in beginning of next turn.\nArmor: DR2 vs energy DMG. Dark Side score is treated as +1.",
        "structured_modifications": [
          {
            "text_description": "Dark Side score is treated as +1 when targeted with something that targets dark side.\nSlashing/Piercing melee weap (not lightsaber): If DMG is above targets FORT DEF target take 1d4 DMG in beginning of next turn.\nArmor: DR2 vs energy DMG. Dark Side score is treated as +1.",
            "target_stat": "Dark Side Score Is Treated As",
            "change_type": "additive_amount",
            "value": 1
          }
        ]
      },
      {
        "id": "living_vehicle_l",
        "name": "Living Vehicle",
        "source_book": "L",
        "page": 69,
        "applies_to_type": "Vehicle",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Used to represent everything from Yuuzhan Vong vehicles to the spacecraft of Zonama Sekot, the living vehicle template allows you to create statistics for biological analogues of existing ships. Though the template won't present the fine mechanical tuning of designing a vehicle from scratch, if you just need a basic living vehicle comparable in firepower to an X- wing starfighter, the living vehicle template should suffice.\nModifications\nTo create a living vehicle, make the following changes to an existing vehicle.\nCL: The CL of a living vehicle is equal to its normal value + 2.\nSR: Typically, the SR of a living ship does not represent traditional shields but some other form of damage absorption. Yuuzhan Vong vessels use dovin basals to help negate damage. A living ship's SR is not reduced by a single attack, even if it exceeds the ship's current SR. A starship with its weapons set to autofire, however, reduces the living ship's SR as normal if the autofire attack's damage exceeds the ship's SR.\nHit Points: Unlike a normal vehicle, Mechanics checks cannot be made to repair hit point damage to a living vehicle. The Treat Injury skill can be used to repair the vehicle's lost hit points.\nNatural Healing: A living vessel regains a number of hit points per day on its own equal to one-half its Fortitude Defense. These hit points are only regained when the vehicle is unused for 8 hours.\nDovin Basals: Yuuzhan Vong living vehicles have dovin basals, small organisms that generate tiny black holes that can be used for special attacks. A dovin basal has the same range as a blaster weapon but cannot fire at targets at long range. A dovin basal does not deal normal hit point damage; instead, if the dovin basal's damage exceeds the target ship's SR, the ship's SR is reduced by 10 instead of by S. Colossal and smaller ships have dovin basals that deal7dlOx2 damage, Colossal (frigate) ships have dovin basals that deal Sd10XS damage, and Colossal (cruiser) and larger ships have dovin basals that deal 7d10xS damage.\nTractor Beams: Yuuzhan Vong living vessels use their dovin basals as tractor beams. Other kinds of living ships have comparable alternatives to emulate a tractor beam's effects.\nWeapons: Living vehicles have analogues for most weapons. Weapons that deal energy damage alone typically deal fire damage instead of normal energy damage. Other weapons, even ion weapons, have analogues on a living vehicle. They behave exactly as the weapon does on the base vehicle.",
        "modifications_summary_text": null,
        "structured_modifications": []
      },
      {
        "id": "mandalorian_manufacture_k",
        "name": "Mandalorian Manufacture",
        "source_book": "K",
        "page": 77,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "A Mandalorian warrior is made great by his or her equipment, and each piece of Mandalorian equipment is unique in some way. Mandalorian items are made with customization in mind; any character making a Mechanics check to repair or modify a weapon or suit of armor of Mandalorian manufacture gains a +5 equipment bonus on the check. However, Mandalorian technology is often based on the designs of other cultures, causing some unusual interaction between technologies; if a Mandalorian item is disabled all of the modifications to that item are destroyed (and much be purchased anew, not merely repaired). Mandalorian-manufactured items cost 10% or 1,000 credits (whichever is higher) more than the base item.\nRestrictions: None.",
        "modifications_summary_text": "+5 on Mechanics check to modify. If equipment is disabled, all mods on it are destroyed.",
        "structured_modifications": [
          {
            "text_description": "+5 on Mechanics check to modify. If equipment is disabled, all mods on it are destroyed.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "massassi_manufacture_k",
        "name": "Massassi Manufacture",
        "source_book": "K",
        "page": 77,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "Built by primitive creatures for use in the service of the Sith, Massassi items are designed to take advantage of the strength of their wielders. Massassi armor allows a critical hit against the wearer to be turned into a normal hit once per encounter as a reaction. However, if a character does not have a sufficient Strength score (13 for light armor, 15 for Medium armor, or 17 for heavy armor) they take armor-check penalties even when proficient in the armor.\nWhen a character scores a critical hit with a Massassi weapon held in two hands, that character triples his Strength bonus to damage (before multiplying for the critical hit); like armor, if a character does not have a sufficient Strength score (15 for Medium weapons, 17 for Large weapons, or 19 for Huge and bigger weapons) then he takes a -2 penalty to attack rolls with that weapon, even if proficient. Massassi-manufactured items cost 100/0 or 1,000 credits (whichever is higher) more than the base item.\nRestrictions: This template can be applied only to armor or to melee simple weapons.",
        "modifications_summary_text": "Melee Simple weap: if weapon is worn in 2 hands, triple STR bonus to DMG on critical hit only. If the user have less than 15 STR (medium weap) 17 (large) 19 (huge or larger) they get -2 penalty to use the weapon.\nArmor: Convert one crit to regular DMG per encounter. If the wearer have less than 13 STR (light armor) 15 (med) or 17 (heavy) they take armor check penalty even if they are proficient.",
        "structured_modifications": [
          {
            "text_description": "Melee Simple weap: if weapon is worn in 2 hands, triple STR bonus to DMG on critical hit only. If the user have less than 15 STR (medium weap) 17 (large) 19 (huge or larger) they get -2 penalty to use the weapon.\nArmor: Convert one crit to regular DMG per encounter. If the wearer have less than 13 STR (light armor) 15 (med) or 17 (heavy) they take armor check penalty even if they are proficient.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "merendata_sgd",
        "name": "MerenData",
        "source_book": "SGD",
        "page": 16,
        "applies_to_type": "Droid",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Another droid manufacturer to benefit from the rise of the Empire, MerenData supplies security, espionage, and interrogation droids to the Imperial military and government agencies. MerenData also produces commercial units, competing with Cybot Galactica. Although it is not a dominant player, MerenData's reliable designs and the company's centuries-long history make it a worthy competitor. MerenData's support of the Empire makes sales to the New Republic initially impossible and undesirable. However, as Imperial influence shrinks, so does MerenData's opposition to doing business with the New Republic-aided by the ousting of company officials tied to the Empire. MerenData is al so a major contributor to the Corporate Sector.\nTraits: MerenData droids are known for their intimidating personalities. When making a Persuasion check to intimidate, a MerenData droid adds its Wisdom bonus to the skill check. When attempting to intimidate another droid, it adds its Wisdom bonus and its Charisma bonus to the check.",
        "modifications_summary_text": "Add WIS bonus to intimidation checks.",
        "structured_modifications": [
          {
            "text_description": "Add WIS bonus to intimidation checks.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "packs_and_swarms_t",
        "name": "Packs and Swarms",
        "source_book": "T",
        "page": 130,
        "applies_to_type": "Sentient",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "The womp rat pack statistics given here represent a womp rat that has been modified to fit the \"pack\" species trait. Creatures that have the \"pack\" or \"swarm\" species trait are actually a group of three or more individual creatures that move and fight as a single unit. They occupy the same space and are treated as a single creature for the purpose of combat, though they might be described as a cluster of several creatures. For example, a womp rat pack has a single statistics block and acts like a single creature, but might actually be three or four womp rats in the context of the encounter's description. Typically, a pack or swarm has a CL 2 higher than the base creature's CL.\nTo create a pack or swarm, make the following changes to the statistics block of any beast:\nIncrease the creature's size by one category, and apply all relevant modifiers.\nDouble the creature's hit points.\nIncrease the creature's damage threshold by 10.\nAll melee attacks are considered melee area attacks, affecting all squares within reach. An adjacent allied pack or swarm is not affected by a pack or swarm's area melee attack.\nAll ranged attacks are considered to have a l-square splash.\nArea attacks deal an extra 2 dice of damage against a pack or swarm.",
        "modifications_summary_text": "size+1; hp x2; DT+10; melee area attacks; ranged have a 1-square splash; take extra 2 dice of damage vs. area attacks",
        "structured_modifications": [
          {
            "text_description": "size+1",
            "target_stat": "Size",
            "change_type": "additive_amount",
            "value": 1
          },
          {
            "text_description": "hp x2",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          },
          {
            "text_description": "DT+10",
            "target_stat": "Dt",
            "change_type": "additive_amount",
            "value": 10
          },
          {
            "text_description": "melee area attacks",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          },
          {
            "text_description": "ranged have a 1-square splash",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          },
          {
            "text_description": "take extra 2 dice of damage vs. area attacks",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "phrik_alloy_r",
        "name": "Phrik Alloy",
        "source_book": "R",
        "page": 126,
        "applies_to_type": "Armor",
        "availability_modification": {
          "text_original": "Rare outside KOTOR era",
          "set_to": "Rare outside KOTOR era",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+20%",
          "options": [
            {
              "type": "percentage_delta",
              "value": 0.2
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "One of the hardest known substances in the galaxy, phrikite is mined at the Imperial facility on Gromas 16. When combined with tydirium it produces phrik alloy, which is lighter and sturdier than duralloy. Phrik alloy also turns aside lightsabers. A lightsaber does not ignore the DR of armor made with phrik. Because of the rarity of phrik alloy, a piece of equipment using this template costs 20% more than the base item.",
        "modifications_summary_text": "DR vs lightsabers",
        "structured_modifications": [
          {
            "text_description": "DR vs lightsabers",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "prototype_general_gear_k",
        "name": "Prototype",
        "source_book": "K",
        "page": 78,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Prototype items are unstable and not ready for release to the general public, but they might have properties that other items do not. A prototype item can have two modifications from the Tech Specialist feat (see page 21 of Starships of the Galaxy) instead of just one. However, a prototype weapon treats a natural roll of 1, 2, 3, or 4 as though it were a natural 1 (thus, automatically missing). and the weapon becomes disabled until repaired. A wearer of prototype armor takes 1 more die of damage from a critical hit (before multiplying); thus, a heavy blaster pistol that scores a critical hit against a target wearing prototype armor deals 4d8 damage base, which is then doubled.\nRestrictions: None.",
        "modifications_summary_text": "2 mods from Tech Specialist (page 21 SotG) instead of one. \nWeapon: 1-4 on rolls using the item is treated as a natural 1 and the weapon gets disabled until repaired.\nArmor: Wearer get +1 die of damage on a critical hit, before doubling.",
        "structured_modifications": [
          {
            "text_description": "2 mods from Tech Specialist (page 21 SotG) instead of one. \nWeapon: 1-4 on rolls using the item is treated as a natural 1 and the weapon gets disabled until repaired.\nArmor: Wearer get +1 die of damage on a critical hit, before doubling.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "prototype_vehicle_s",
        "name": "Prototype",
        "source_book": "S",
        "page": 123,
        "applies_to_type": "Vehicle",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "The prototype template represents the model of a starship that is used to find any hidden flaws and test new systems before the starship goes into production. A prototype is lovingly hand-built by teams of engineers, since no mass-production line exists to churn it out yet. Some classes of ships are always built as prototypes, and then have the prototype template removed as a final construction stage.\nThe prototype template can also be used to represent a unique ship built by a small group that has no intention of ever turning it into a mass-produced starship. Some pirates and rich traders have custom ships hand-crafted for their use, and occasionally a ship is so extensively rebuilt that it qualifies as a prototype of a new class of ship. Some Rebel Alliance capital ships built from older vessels fall into this last category.\nA ship can have the prototype template removed by a massive overhaul that reengineers all its systems to normal tolerances. This is a time-consuming and expensive proposition. It has a base cost of 50,000 credits modified by the starship's cost modifier based on size (see Cost Modifiers, page 38), and takes 1 day per 5,000 credits of that cost.\nMODIFICATIONS \nThreshold: A prototype isn't quite as resistant to incoming damage, since it doesn't have the benefit of being redesigned after every bad design element has been discovered. Lower its damage threshold by an amount equal to its size modifier (-1 Large, -2 Huge, -5 Gargantuan, -10 for Colossal and larger).\nAbilities: Increase Strength, Dexterity, and Intelligence by 2. Prototypes have the advantage of having their systems double-checked, fine-tuned, and carefully recalibrated, and they enjoy a level of precision engineering impossible to maintain on a production line. Recalculate all statistics derived from these abilities' modifiers.\nSpeed: The careful tuning of a prototype's engines gives it a +1-square bonus to starship-scale movement.\nRandom Benefit/Drawback: A prototype always has at least one benefit and one drawback over standard starships of its class, which are lost in mass production. (Some prototypes have two benefits and drawbacks.) Roll randomly to see which statistic increases and which is reduced: armor (+2/-2), hit points (+10%/-100/0), SR (+25%/-25%), starship scale speed (+1 square/-1 square), crew (-70%/+300/0), passengers (+500/0 total/-500/0 total), cargo (+500/0 total/-500/0 total), carried craft (-750/0/+250/0) or weapons (double number of one weapon type, half number of one weapon type). You can't have a benefit and drawback in the same category.\nMaintenance Requirement: A prototype manages to maintain its high precision tuning only if it is regularly given good maintenance. A prototype requires 8 hours of maintenance a month and a DC 20 Mechanics check to keep it running smoothly. If the maintenance isn't kept up, or the Mechanics check for doing so fails, the prototype loses its +2 ability increases and its random benefit (but not its random drawback), and moves -1 step down its condition track.",
        "modifications_summary_text": "STR,DEX,INT+2; Speed+1; Random Benefit/Drawback; Maintenance Requirement",
        "structured_modifications": [
          {
            "text_description": "STR,DEX,INT+2",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          },
          {
            "text_description": "Speed+1",
            "target_stat": "Speed",
            "change_type": "additive_amount",
            "value": 1
          },
          {
            "text_description": "Random Benefit/Drawback",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          },
          {
            "text_description": "Maintenance Requirement",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "quick_draw_weapon_k",
        "name": "Quick Draw Weapon",
        "source_book": "K",
        "page": 79,
        "applies_to_type": "Weapon",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10%",
          "options": [
            {
              "type": "percentage_delta",
              "value": 0.1
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "These weapons are specially designed to be pulled quickly, whether by modification to the blaster or to its holster. A quick draw weapon wielder that possesses the Quick Draw feat can draw or holster the weapon once per round as a free action. A quick draw weapon costs 10% more than the cost of the base weapon.\nRestrictions: None.",
        "modifications_summary_text": "With quick draw feat, draw or holster as free action once per round.",
        "structured_modifications": [
          {
            "text_description": "With quick draw feat, draw or holster as free action once per round.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "rakatan_weapon_k",
        "name": "Rakatan Weapon",
        "source_book": "K",
        "page": 79,
        "applies_to_type": "Weapon",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+30% or +3000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.3
            },
            {
              "type": "fixed_amount",
              "value": 3000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "Crafted by an ancient and extremely advanced species known as the Rakata, weapons with this template are powerful and extremely alien to modern species. Rakatan weapons increase their die type by one step (from d4 to d6, d6 to d8, d8 to d10, or d10 to a maximum of d12) and grant the wielder a +1 equipment bonus on attack rolls. Rakatan weapons are considered exotic weapons, except to Rakatan characters (who treat them as weapons of their normal weapon group). Rakatan weapons cost 30% or 3,000 credits (whichever is higher) more than the base item . .  \nRestrictions: None.",
        "modifications_summary_text": "Die step is increased by one (d4=d6, d6=d8 etc up to d12) and increase ATK bonus +1. Exotic except for Rakatan.",
        "structured_modifications": [
          {
            "text_description": "Die step is increased by one (d4=d6, d6=d8 etc up to d12) and increase ATK bonus +1. Exotic except for Rakatan.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "refitted_weapon_l",
        "name": "Refitted",
        "source_book": "L",
        "page": 101,
        "applies_to_type": "Vehicle",
        "availability_modification": {
          "text_original": "Rare",
          "set_to": "Rare",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "Used sale price +20%",
          "options": [
            {
              "type": "set_to_used_price",
              "description": "Used sale price +20%"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "A refitted vehicle is an older model from years past that has had its internal components upgraded to take advantage of advances in modern technology. A refitted vehicle maintains the basic structure of the original vehicle but has the latest and greatest parts available in the current era.\nCost: Refitted vehicles are only available at their used sale price + 20% for the cost of refitting.\nAvailability: All refitted vehicles gain the Rare availability, if they do not already have it. \nRepairs: Since refitted vehicles combine antiquated technology with modern components, sometimes the vehicle must be treated gently and repairs can be challenging. A refitted vehicle increases the base DC of any Mechanics checks made to repair it by +5.\nMaintenance: Unlike normal vehicles, refitted vehicles must be given extra maintenance to ensure that they continue to function as expected. Once per week the vehicle must receive regular maintenance, which requires 1 hour of work (no Mechanics check required, though a tool kit is necessary to perform the maintenance). Failure to perform this maintenance moves the vehicle -1 persistent step down the condition track for each day it does not receive maintenance after one week.",
        "modifications_summary_text": "Repairs +5 DC. Needs weekly maintenance (read rules)",
        "structured_modifications": [
          {
            "text_description": "Repairs +5 DC. Needs weekly maintenance (read rules)",
            "target_stat": "Repairs DC",
            "change_type": "modify_dc",
            "value": 5,
            "skill": "Mechanics"
          }
        ]
      },
      {
        "name": "Refitted",
        "source_book": "L",
        "page": 100,
        "applies_to_type": "Weapon",
        "availability_modification": {
          "text_original": "Rare",
          "set_to": "Rare",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+20%",
          "options": [
            {
              "type": "percentage_delta",
              "value": 0.2
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "When a character refits a weapon, he or she upgrades its interchangeable parts with components that use the latest advances in weapon technology. Refitted weapons have the following changes to their statistics.\nCost: Refitted weapons have their prices increased by 20% due to rarity and the innate cost of refitting the weapon.\nAvailability: Al l refitted weapons gain the Rare availability, if they do not already have it.\nEnergy Cell: A refitted weapon can use standard energy cells and power packs. Additionally, weapons that use power packs to provide ammunition have their number of shots that can be fired before the power pack must be replaced increased by 10%.\nRepairs: Since refitted weapons combine antiquated technology with modern components, sometimes the weapon must be treated gently and repairs can be challenging. A refitted weapon increases the base DC of any Mechanics checks made to repair the weapon by +5.\nMaintenance: Unlike normal weapons, refitted weapons require extra maintenance to ensure that they continue to function as expected. Once per week the weapon must receive regular maintenance, which requires 1 hour of work (no Mechanics check required, though a tool kit is necessary to perform the maintenance). Failure to perform this maintenance moves the weapon - 1 persistent step down the condition track for each day it does not receive maintenance after one week.",
        "modifications_summary_text": "+10% more shots per power pack. Repir is done at +5 DC. Needs weekly maintenance (read rules).",
        "structured_modifications": [
          {
            "text_description": "+10% more shots per power pack. Repir is done at +5 DC. Needs weekly maintenance (read rules).",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "retractable_stocks_cr",
        "name": "Retractable Stocks",
        "source_book": "CR",
        "page": 125,
        "applies_to_type": "Weapon",
        "availability_modification": {
          "text_original": null,
          "set_to": null
        },
        "cost_modification": {
          "text_original": "Varies (some weapons have it standard, affecting base price)",
          "options": [
            {
              "type": "text_description",
              "description": "May affect base weapon price or be an add-on."
            }
          ]
        },
        "full_text_description": "Some weapons, such as the E-11 blaster rifle used by stormtroopers and the E-5 blaster carbine used by battle droids, have a retractable stock. Only rifles and pistols (and rifle- or pistol-like exotic weapons) can have a retractable stock. Extending or folding a retractable stock is a move action. When the stock is folded, the following rules apply: Treat the weapon as a pistol for purposes of proficiency and range. You cannot brace the weapon while using it in autofire mode, even if it is an autofire-only weapon. When the stock is extended, the following rules apply: Treat the weapon as a rifle for purposes of proficiency and range. You take a -5 penalty on attack rolls with the weapon if you use it in one hand (regardless of its size relative to you).",
        "modifications_summary_text": "Move action to extend/fold. Folded: treat as pistol for proficiency/range; cannot brace for autofire. Extended: treat as rifle for proficiency/range; -5 attack if one-handed.",
        "structured_modifications": [
          {
            "target_stat": "Weapon Handling (Stock Folded)",
            "change_type": "text_rule",
            "notes": "Treat as pistol for proficiency and range. Cannot brace for autofire."
          },
          {
            "target_stat": "Weapon Handling (Stock Extended)",
            "change_type": "text_rule",
            "notes": "Treat as rifle for proficiency and range. -5 penalty on attack rolls if used one-handed."
          },
          {
            "target_stat": "Action to Change Stock",
            "change_type": "text_rule",
            "notes": "Extending or folding stock is a move action."
          }
        ]
      },
      {
        "id": "roche_sgd",
        "name": "Roche",
        "source_book": "SGD",
        "page": 16,
        "applies_to_type": "Droid",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Roche is the popular nickname for the Verpine droid manufacturer Roche Hive Mechanical Apparatus Design and Construction Activity for Those Who Need the Hive's Machines. Like their creators, Roche droids are insectoid, causing poor sales of early models, even to other insectoid species. However, the Verpines' love of technology drives them to refine the line, so their line of droids slowly expands into the galactic market. Limited distribution makes new units difficult to obtain, requiring making a trip to the Roche System or locating an Ithorian herdship with an authorized dealer. Used units-especially worker drones and other early models-can be purchased at a highly discounted rate from used droid and junk dealers throughout the backwaters of the galaxy.\nTraits: Roche units are precisely constructed with easily modified appendages and accessories. When modifying an appendage, an accessory, a tool, a weapon, or an instrument mounted on an appendage, apply a +5 circumstance bonus to the Mechanics check (see page 197 of the Saga Edition core rulebook) . This bonus does not apply to droids modifying themselves.",
        "modifications_summary_text": "Others gain +5 on Mechanics to modify appendages/accessories.\nDoesn't apply when droid modifies itself.",
        "structured_modifications": [
          {
            "text_description": "Others gain +5 on Mechanics to modify appendages/accessories.\nDoesn't apply when droid modifies itself.",
            "target_stat": "Others Gain",
            "change_type": "additive_amount",
            "value": 5
          }
        ]
      },
      {
        "id": "sensory_enhancement_gw",
        "name": "Sensory enhancement",
        "source_book": "GW",
        "page": 50,
        "applies_to_type": "Cybernetics",
        "availability_modification": {
          "text_original": "Restricted",
          "set_to": "Restricted",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "800 + 3000 surgery",
          "options": [
            {
              "type": "text_description",
              "description": "800 + 3000 surgery"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Sensory Enhancement\nThe sensory-enhancement package places cybernetic augmentations on nerve endings in various sensory organs, reducing the signal-to-noise ratio and allowing the host to notice what might otherwise have been missed. A character with the sensory-enhancement package reduces by 2 any penal­ties to Perception checks made to notice a target with concealment or total concealment.",
        "modifications_summary_text": "Rejection +14 vs. Fort; penalty to Perception reduced by 2 v. target in concealment or total concealment",
        "structured_modifications": [
          {
            "text_description": "Rejection +14 vs. Fort",
            "target_stat": "Rejection",
            "change_type": "additive_amount",
            "value": 14
          },
          {
            "text_description": "penalty to Perception reduced by 2 v. target in concealment or total concealment",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "serv-o-droid_sgd",
        "name": "Serv-O-Droid",
        "source_book": "SGD",
        "page": 17,
        "applies_to_type": "Droid",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Serv-O-Droid is one of the galaxy's older and more successful droid manufacturers. Spanning thousands of years, from the time of the Old Republic until the years before the Clone Wars, Serv-O-Droid specializes in service droids and worker droids, including personal assistants and heavy duty commercial labor units. However, the company makes a series of bad business decisions, allying with the Republic's bureaucracy. The result is a political nightmare. Corrupt Senators give the company tax breaks and other favors but demand great monetary and political payments in return . As the corrupt Republic declines, so does Serv-O-Droid, despite expanding into security and professional assistant models. Its assets are liquidated and sold off to the Corporate Sector Authority. However, new units are still available through the Droid reserve, a droid remainder reseller located on Elshandruu Pica. With millions of fully operational units to sell , the reseller makes Serv-O-Droid units and spare parts available for years.\nTraits: Serv-O-Droids are highly reliable units. When recharging, they can remove one persistent condition that requires repairs to remove per day, moving + 1 step on the condition track.",
        "modifications_summary_text": "Remove 1 persistent condition while recharging.",
        "structured_modifications": [
          {
            "text_description": "Remove 1 persistent condition while recharging.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "shaped_beast_l",
        "name": "Shaped Beast",
        "source_book": "L",
        "page": 220,
        "applies_to_type": "Sentient",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Shaped beasts are creatures altered by Yuuzhan Vong shapers during or after the Yuuzhan Vong invasion. Unlike the vongspawn (see page XX), these creatures do not suffer from their shaped state, and often their inherent characteristics are enhanced or complemented in some fashion. They can be detected by Force-users. Though skilled shapers can alter almost any part of a living organism, some forms of bioengineering are quite common. The shaped beast template (see below) provides a starting point for Yuuzhan Vong-altered creatures. The Gamemaster should select attributes from the list, but is free to add features or abilities as required to meet a specific creature concept.\nShaped Beast Template \nA shaped beast has the statistics of the base creature, with one or more of the following modifications. Each modification increases the CL of the creature by 1.\nArmored Defenses: Increase the base creature's defenses by +3.\nEnhanced Resilience: The creature gains Improved Damage Threshold as a bonus feat, increasing its Damage Threshold by 5, and gains +2 hit points per beast level.\nImproved Natural Weapons: The base creature's natural weapons deal 1 additional die of damage per attack. For example, if the base creature as a bite attack that deals 1d6+5 damage, the shaped version of the creature would deal 2d6+5 damage with its bite instead.\nIncreased Aggression: The creature gains a +2 rage bonus on melee attack rolls.\nPoison Attack: The creature's bite, claw, or sting attack (determined by the Gamemaster) is poisonous. If the attack hits and the attack roll result equals or exceeds the target's Fortitude Defense, the attack deals an extra 2  dice of damage and the target moves -2 persistent steps down the condition track. This persistent condition can be removed with the Treat Poison application of the Treat Injury skill (see page 75 of the Saga Edition core rulebook).",
        "modifications_summary_text": "can add armor, DT, hp, Improved Natural Weapons, Increased Aggression, Poison Attack",
        "structured_modifications": [
          {
            "text_description": "can add armor, DT, hp, Improved Natural Weapons, Increased Aggression, Poison Attack",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "sith_abomination_j",
        "name": "Sith Abomination",
        "source_book": "J",
        "page": 22,
        "applies_to_type": "Sentient",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "The Sith alchemists of the past were not just content to create powerful weapons and suits of armor-they also wanted living weapons. The ancient Sith who first discovered alchemical secrets learned to manipulate the genetic structure of living creatures, even sentient species. The Sith abomination is the result, the Massassi abomination (see page 123) but one example. \nTo create a Sith abomination, make the following changes to a creature's statistics:\nChallenge Level: Increase the base creature's CL by + 1.\nDark Side Score: A Sith abomination always has a Dark Side Score equal to its Wisdom score.\nAbility Scores: Increase the base creature's Constitution score by +4. Decrease the base creature's Intelligence and Wisdom scores by -2 each.\nAbominable Presence: Any creature that starts its turn within 6 squares of a Sith abomination is subject to an attack (1d20 + the base creature's Strength or Constitution bonus, whichever is higher) against its Will Defense. If the attack succeeds, the creatures moves -1 step down the condition track. This is a fear effect. Other Sith abominations are immune to this effect.\nForce Sensitivity: All Sith abominations gain the Force Sensitivity feat as a bonus feat.",
        "modifications_summary_text": "CL+1; DSS=WIS; CON+4; INT-2; WIS-2; Abominable Presence; Force Sensitivity",
        "structured_modifications": [
          {
            "text_description": "CL+1",
            "target_stat": "Cl",
            "change_type": "additive_amount",
            "value": 1
          },
          {
            "text_description": "DSS=WIS",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          },
          {
            "text_description": "CON+4",
            "target_stat": "Con",
            "change_type": "additive_amount",
            "value": 4
          },
          {
            "text_description": "INT-2",
            "target_stat": "Int",
            "change_type": "subtractive_amount",
            "value": 2
          },
          {
            "text_description": "WIS-2",
            "target_stat": "Wis",
            "change_type": "subtractive_amount",
            "value": 2
          },
          {
            "text_description": "Abominable Presence",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          },
          {
            "text_description": "Force Sensitivity",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "sith_alchemical_weapon_k",
        "name": "Sith Alchemical Weapon",
        "source_book": "K",
        "page": 79,
        "applies_to_type": "Weapon",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+20% or +2000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.2
            },
            {
              "type": "fixed_amount",
              "value": 2000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "Sith alchemical weapons are items that have undergone an arcane enhancement process using ancient Sith techniques. Favored by the Sith in the days prior to the spread of lightsabers, Sith alchemical weapons are not only resistant to damage but also channel the dark side through them. Ancient Sith Lords used alchemy to fundamentally alter the chemical makeup of their weapons, resulting in something far more dangerous than the typical sword or lanvarok.\nA lightsaber does not ignore a Sith alchemical weapon's DR, and characters who are proficient with the Sith alchemical weapon can treat it as a lightsaber for the purpose of using the Block, Deflect, and Redirect Shot talents (and any talents that have those Jedi talents as a prerequisite).\nAdditionally, a Sith alchemical weapon becomes more powerful in the hands of a character who is steeped in the dark side of the Force. A character proficient in Sith alchemical weapon use can spend a Force Point as a swift action to gain a bonus to damage rolls with the Sith alchemical weapon equal to his or her Dark Side Score. This bonus to damage applies to the next attack made with the weapon before the end of the encounter, and activating this ability increases the wielder's Dark Side Score by 1.\nSith alchemical weapons cost 20% or 2,000 credits (whichever is higher) more than the base item.\nRestrictions: This template can be applied only to advanced melee weapons and simple melee weapons.",
        "modifications_summary_text": "Advanced or simple melee weapon: Lightsabers doesn't ignore DR for this weapon. It can block, deflect and redirect like a lightsaber, and use any talent with Jedi as prereq. Dark side users can spend fp as swift action to gain bonus damage to next attack equal to dark side score, but gives them a dark side point.",
        "structured_modifications": [
          {
            "text_description": "Advanced or simple melee weapon: Lightsabers doesn't ignore DR for this weapon. It can block, deflect and redirect like a lightsaber, and use any talent with Jedi as prereq. Dark side users can spend fp as swift action to gain bonus damage to next attack equal to dark side score, but gives them a dark side point.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "skeletal_reinforcement_gw",
        "name": "Skeletal reinforcement",
        "source_book": "GW",
        "page": 50,
        "applies_to_type": "Cybernetics",
        "availability_modification": {
          "text_original": "Restricted",
          "set_to": "Restricted",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "10000 + 50000 surgery",
          "options": [
            {
              "type": "text_description",
              "description": "10000 + 50000 surgery"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Skeletal Reinforcement\nThis cybernetic enhancement package enhances the host's skeleton with high-impact polymers, increasing bone density and the ability to endure high-impact collisions. A character with skeletal reinforcements gains a +2 equipment bonus to damage threshold.",
        "modifications_summary_text": "Rejection +12 vs. Fort; +2 threshold",
        "structured_modifications": [
          {
            "text_description": "Rejection +12 vs. Fort",
            "target_stat": "Rejection",
            "change_type": "additive_amount",
            "value": 12
          },
          {
            "text_description": "+2 threshold",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "squad_c",
        "name": "Squad",
        "source_book": "C",
        "page": 94,
        "applies_to_type": "Sentient",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Creating a Squad\nTo create a squad, make the following changes to the statistics block of any character: \n• Increase the character's size by one category, and apply all relevant modifiers. \n• Double the character's hit points. \n• Increase the character's damage threshold by 10. \n• Add +4 to all attack rolls, as the members of the squad are considered to be aiding one another. \n• The squad's CL is equal to the CL of the base creature +2.\nSquad Traits\nSquads share the following special traits: \n• All melee attacks made by a squad are considered melee area attacks that affect all squares within the squad's reach (although a squad can choose not to affect a target with its attacks). \n• All ranged attacks made by a squad are considered to have a 1-square splash. If the squad's weapon already has a splash effect, increase the splash radius by 1 square. \n• A squad can choose not to affect allies with its attacks. \n• Area attacks deal +2 dice of damage against a squad. \n• A squad cannot be grabbed or grappled. \n• A squad can make attacks of opportunity against creatures that provoke them, though these attacks of opportunity are not considered area attacks.",
        "modifications_summary_text": "size+1; hp x2; DT+10; atk+4; CL +2; melee attacks = area; ranged+1sq splash;",
        "structured_modifications": [
          {
            "text_description": "size+1",
            "target_stat": "Size",
            "change_type": "additive_amount",
            "value": 1
          },
          {
            "text_description": "hp x2",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          },
          {
            "text_description": "DT+10",
            "target_stat": "Dt",
            "change_type": "additive_amount",
            "value": 10
          },
          {
            "text_description": "atk+4",
            "target_stat": "Atk",
            "change_type": "additive_amount",
            "value": 4
          },
          {
            "text_description": "CL +2",
            "target_stat": "Cl",
            "change_type": "additive_amount",
            "value": 2
          },
          {
            "text_description": "melee attacks = area",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          },
          {
            "text_description": "ranged+1sq splash",
            "target_stat": "Ranged",
            "change_type": "additive_amount",
            "value": 1
          }
        ]
      },
      {
        "id": "stripping_equipment_sv",
        "name": "Stripping Equipment",
        "source_book": "SV",
        "page": 38,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": null,
        "modifications_summary_text": null,
        "structured_modifications": []
      },
      {
        "id": "stygian-triprismatic_polymer_r",
        "name": "Stygian-Triprismatic Polymer",
        "source_book": "R",
        "page": 126,
        "applies_to_type": "Armor",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+20%",
          "options": [
            {
              "type": "percentage_delta",
              "value": 0.2
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Harder and more durable than standard plastoid, stygian-triprismatic polymer is used in the manufacture of Blackhole stormtrooper armor and some types of Mandalorian armor. It increases the armor's bonus by 1, and adds a +2 equipment bonus to Stealth checks to avoid being detected by electronic sensors. Armor made with stygian-triprismatic polymer costs 20% more than the base armor.",
        "modifications_summary_text": "Armor bonus +1, +2 to stealth checks to avoid electronic sensors.",
        "structured_modifications": [
          {
            "text_description": "Armor bonus +1, +2 to stealth checks to avoid electronic sensors.",
            "target_stat": "Armor Bonus",
            "change_type": "additive_amount",
            "value": 1
          }
        ]
      },
      {
        "id": "superior_tech_sv",
        "name": "Superior Tech",
        "source_book": "SV",
        "page": 24,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+20% or +2000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.2
            },
            {
              "type": "fixed_amount",
              "value": 2000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": null,
        "modifications_summary_text": null,
        "structured_modifications": []
      },
      {
        "id": "tech_specialist_s",
        "name": "Tech Specialist",
        "source_book": "S",
        "page": 21,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": null,
        "modifications_summary_text": null,
        "structured_modifications": []
      },
      {
        "id": "tendrando_arms_sgd",
        "name": "Tendrando Arms",
        "source_book": "SGD",
        "page": 17,
        "applies_to_type": "Droid",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "The Yuuzhan Vong invasion decimates the galactic droid market. Because of their fanatical hatred of mechanical automatons, the Yuuzhan Vong raze droid plants by the thousands, destroying or disabling companies and causing the shutdown of plants far from the invasion corridor. Lando Calrissian and his wife, Tendra Risant, restart several idle factories with their new company, Tendrando Arms, producing droids specifically designed to battle the Yuuzhan Vong. With the defeat of the Yuuzhan Vong, Tendrando Arms provides security, guardian, and related droids to the Galactic Alliance and the Jedi Order.\nTraits: Tendrando Arms droids are efficient security and combat droids. Their YVH droid design (see page 158) angers the Yuuzhan Vong at a primitive level. Tendrando Arms droids use this antagonism to their advantage. A Tendrando Arms droid gains a +2 circumstance bonus to its Reflex Defense and Will Defense against Yuuzhan Vong.",
        "modifications_summary_text": "+2 circumstance to Ref. and Will Def. vs Yuuzhan Vong.",
        "structured_modifications": [
          {
            "text_description": "+2 circumstance to Ref. and Will Def. vs Yuuzhan Vong.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "the_aggressive_follower_c",
        "name": "The Aggressive Follower",
        "source_book": "C",
        "page": 34,
        "applies_to_type": "Sentient",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Aggressive followers are focused on attacks and depleting enemy resources. They are somewhat tougher than other followers because they put themselves in harm's way more often and are more likely to attack an enemy target.\nDefenses: An aggressive follower gains a +2 bonus to Fortitude Defense.\nBase Attack Bonus: An aggressive follower uses the soldier class's base attack bonus progression (see page 51 of the Saga Edition core rulebook).\nAbility Scores: An aggressive follower gains a +2 bonus to Strength or Constitution (your choice).\nTrained Skills: Aggressive followers are trained in Endurance.\nFeats: Aggressive followers gain the Weapon Proficiency (pistols) feat.",
        "modifications_summary_text": "trained in Endurance, Weapon Proficiency (pistols)",
        "structured_modifications": [
          {
            "text_description": "trained in Endurance, Weapon Proficiency (pistols)",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "the_defensive_follower_c",
        "name": "The Defensive Follower",
        "source_book": "C",
        "page": 34,
        "applies_to_type": "Sentient",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Defensive followers specialize in protecting themselves from damage and, similarly, holding a defensive position. Defensive followers make excellent support fighters, laying down suppression fire or helping to hold a corridor against an invading force.\nDefenses: A defensive follower gains a +2 bonus to Reflex Defense.\nBase Attack Bonus: A defensive follower uses the scoundrel class's base attack bonus progression (see page 45 of the Saga Edition core rulebook).\nAbility Scores: A defensive follower gains a +2 bonus to Dexterity or Wisdom (your choice).\nTrained Skills: Defensive followers are trained in Endurance.\nFeats: Defensive followers gain the Armor Proficiency (light) feat.",
        "modifications_summary_text": "trained in Endurance, Armor Proficiency (light)",
        "structured_modifications": [
          {
            "text_description": "trained in Endurance, Armor Proficiency (light)",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "the_utility_follower_c",
        "name": "The Utility Follower",
        "source_book": "C",
        "page": 34,
        "applies_to_type": "Sentient",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Utility followers are typically skilled in several areas, allowing them to contribute to a variety of situations where skill checks are called for. Utility followers might be demolitions experts, slicers, saboteurs, or any number of other professions that rely on skills to excel.\nDefenses: A utility follower gains a +2 bonus to Will Defense.\nBase Attack Bonus: A utility follower uses the scoundrel class's base attack bonus progression (see page 45 of the Saga Edition core rulebook).\nAbility Scores: A utility follower gains a +2 bonus to Intelligence or Charisma (your choice).\nSkills: Utility followers are trained in one skill of your choice (except Use the Force).\nFeats: Utility followers gain either the Armor Proficiency (light) feat or the Weapon Proficiency (pistols) feat (your choice at time of follower creation) .",
        "modifications_summary_text": "trained in any skill (except Use the Force), Armor Proficiency (light) or Weapon Proficiency (pistols)",
        "structured_modifications": [
          {
            "text_description": "trained in any skill (except Use the Force), Armor Proficiency (light) or Weapon Proficiency (pistols)",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "tremor_sensor_gw",
        "name": "Tremor sensor",
        "source_book": "GW",
        "page": 50,
        "applies_to_type": "Cybernetics",
        "availability_modification": {
          "text_original": "Restricted",
          "set_to": "Restricted",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "400 + 3750 surgery",
          "options": [
            {
              "type": "text_description",
              "description": "400 + 3750 surgery"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Tremor Sensor\nA tremor sensor is installed in the feet of the host. Connected to the nervous system, the tremor sensor detects minute vibrations in the ground, warn­ing the host of approaching enemies. A creature with the tremor-sensor enhancement takes no penalty to Perception checks to notice targets that have concealment or total concealment, provided the target moved on its last turn.",
        "modifications_summary_text": "Rejection +7 vs. Fort; no penalty to Perception v. target in concealment or total concealment",
        "structured_modifications": [
          {
            "text_description": "Rejection +7 vs. Fort",
            "target_stat": "Rejection",
            "change_type": "additive_amount",
            "value": 7
          },
          {
            "text_description": "no penalty to Perception v. target in concealment or total concealment",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "uglies_sv",
        "name": "Uglies",
        "source_book": "SV",
        "page": 66,
        "applies_to_type": "Vehicle",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": null,
        "modifications_summary_text": null,
        "structured_modifications": []
      },
      {
        "id": "unit_c",
        "name": "Unit",
        "source_book": "C",
        "page": 95,
        "applies_to_type": "Sentient",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Creating a Unit \nTo create a unit, make the following changes to the statistics block of a base creature to transform it into a unit:\nChallenge Level: The unit has a CL equal to its base CL + 6.\nSize and Type: All un its are considered Colossal in size. Colossal (frigate) and larger vehicles are typically used as terra in, not units in mass combat. See the \"Colossal Vehicles\" sidebar for more in formation on how to use larger vehicles and starships.\nInitiative and Senses: Use the Initiative and Senses of the base creature.\nDefenses: The un it retains the defenses of the base creature.\nHit Points: The unit multiplies its hit points by 4.\nDR/SR: The unit uses the SR of the base creature, and gains DR 15.\nThreshold : Replace the base creature's size bonus to damage threshold, if any, with a +50 size bonus to damage threshold.\nAttrition: All units have a set of 3 attrition numbers. Each time a unit's hit points drop below one of the steps in the attrition list, the unit moves-1 persistent step down the condition track. Using the example unit below, when a clone trooper battalion drops below 62 hit points, it moves -1 persistent step on the condition track. If the unit drops below 42 hit points, it is now -2 persistent steps on the condition track. The persistent condition cannot be removed from the unit.\nTo determine attrition numbers, divide the unit's total hit points by 4 (rounding down). Then, subtract that number from the total hit points 3 times, each time marking the result on the attrition line.\nSpeed : For most base creatures, the unit's base speed at starship scale is 1 square. Certain creatures with a high base speed can move faster (see \"Speed,\" below). The unit retains the movement mode of the base creature.\nMelee Attacks: Convert basic melee attacks to unit melee attacks. Attack bonuses remain the same, but all attacks without a damage multiplier gain a x2 damage multiplier.\nRanged Attacks : Convert basic ranged attacks to unit ranged attacks. Attack bonuses remain the same, but all attacks without a damage multiplier gain a x2 damage multiplier.\nFighting Space: All units have a fighting space of 1 square at starship scale.\nBase Attack and Grapple: The unit retains the base attack and grapple scores of the base creature.\nAbility Scores : The unit retains the ability scores of the base creature.\nTalents and Feats : Units have no talents or feats. However, the unit retains the benefit of any talents or feats of the base creature that provide a flat numerical benefit, such as Weapon Focus, Weapon Specialization, Improved Defenses, or Martial Arts I. If the unit has talents or feats that alter attack rolls with flat numerical values (such as Power Attack, Rapid Shot, or Burst Fire). those attack options can be converted as well. Units cannot use talents or feats that rely on other conditions or situations to activate.\nSkills: The unit retains the skill modifiers of the base creature.\nPossessions: Units have only the possessions relevant to their attacks and defenses.",
        "modifications_summary_text": null,
        "structured_modifications": []
      },
      {
        "id": "veril_line_systems_sgd",
        "name": "Veril Line Systems",
        "source_book": "SGD",
        "page": 17,
        "applies_to_type": "Droid",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Veril Line Systems, often called Veriline for short, excels at industrial droid design. Its units are plain but reliable and durable, and its signature power droids can be found in most starports. Veriline units feature highly efficient processing systems. The droids have only enough processing and analytical ability to fulfill their simple and monotonous jobs. When dealing with tasks or situations beyond their programming, Veriline's cheaper units are simplistic at best, and downright stupid at worst. Units that require sophisticated programming receive exactly what they need to be successful, but no more. Veriline is headquartered on Coruscant and utilizes Telti droid plants as well as assembly lines of its own on or near major industrial worlds.\nTraits: Veril Line Systems droids are highly resilient. Once per day, a Veriline droid can make a DC 20 Endurance check to extend its run time by 25 hours or t o move + 1 step on the condition track.",
        "modifications_summary_text": "1xDay, DC20 check to extend usetime +25h or move +1 condition.",
        "structured_modifications": [
          {
            "text_description": "1xDay, DC20 check to extend usetime +25h or move +1 condition.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "verpine_manufacture_k",
        "name": "Verpine manufacture",
        "source_book": "K",
        "page": 78,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "+10% or +1000 credits\nwhichever is higher",
          "options": [
            {
              "type": "set_to_percentage_of_base",
              "value": 0.1
            },
            {
              "type": "fixed_amount",
              "value": 1000
            }
          ],
          "selection_logic": "whichever_is_more"
        },
        "full_text_description": "The insectoid Verpine are technological masters who can create items with exceptional characteristics. Verpine armor and shields provide DR 10 against ion damage. As a swift action, a Verpine weapon can be switched to ion fire mode, changing the weapon to deal ion damage instead of normal damage (at the same damage dice). However, Verpine items are designed for their unique physiologies, and they require the owner to have a minimum Dexterity of 13+ to wear their armor effectively (otherwise the wearer takes armor check penalties) or a minimum Intelligence of 13+ to operate their weapons properly (otherwise the wielder takes a -2 penalty to attack rolls with that weapon). Verpine-manufactured items cost 10% or 1,000 credits (whichever is higher) more than the base item.\nRestrictions: This template can be applied only to armor or to ranged weapons that deal energy damage.",
        "modifications_summary_text": "Energy Weapon: Change to ion DMG with swift action. Need INT 13+, else -2 on ATK rolls.\nArmor: DR 10 vs ion DMG. Need DEX 13+, else armor check penalty.",
        "structured_modifications": [
          {
            "text_description": "Energy Weapon: Change to ion DMG with swift action. Need INT 13+, else -2 on ATK rolls.\nArmor: DR 10 vs ion DMG. Need DEX 13+, else armor check penalty.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      },
      {
        "id": "vongspawn_l",
        "name": "Vongspawn",
        "source_book": "L",
        "page": 217,
        "applies_to_type": "Sentient",
        "availability_modification": {
          "text_original": null,
          "set_to": null,
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "",
          "options": [
            {
              "type": "text_description",
              "description": "None Specified"
            }
          ],
          "selection_logic": null
        },
        "full_text_description": "Vongspawn are beings that have been infected and mutated by sabotaged Yuuzhan Vong coral seeds. Most Vongspawn become outcasts, left to struggle with the painful and violent disease on their own. Naturally, they often become violent or desperate in their search for a cure. The highest concentration of these unfortunate beings is thought to be in the lower levels of Coruscant. \nVongspawn Coral Seeds The term \"Vongspawn\" started as a curse word, but after the Yuuzhan Vong war it became a derisive term referring to those unfortunate individuals infected by Sith-sabotaged Yuuzhan Vong coral seeds. Dormant sabotaged seeds must be activated by a Sith using the dark side of the Force. Active coral seeds can infect any species, causing painful spikes to grow from the victim's skin. Other mutations have been documented as well. The disease is nigh incurable, though it is possible that the Yuuzhan Vong will develop a cure someday. Even the Force provides little help. Those with the disease are exiled from their communities out of fear of transmitting the symptoms and mutations to others.\nThe disease makes an attack roll against any living creature that comes into contact with it. Roll 1d20+10 and compare the result to the target's Fortitude Defense. On a hit, the disease infects the target. Coral tumors and spikes begin to grow immediately, moving the character -1 persistent step down the condition track. Every 5 minutes thereafter, make a new attack roll against the target's Fortitude Defense. If the disease pushes the target to the bottom of the condition track, the target dies instead of falling unconscious. If the disease misses an attack roll, it stops making attack rolls and does not proceed any further.\nA character or creature that survives the disease becomes a Vongspawn (see below) . As this is a Yuuzhan Vong disease, Force Points cannot be used to prevent death. However, a Destiny Point can be spent to turn a successful attack by the disease into a miss, thereby stopping the advancement of the disease.\nCuring the disease requires a DC 40 Treat Injury check, and Force Points cannot be spent to increase the skill check result. Yuuzhan Vong shapers hope to find a cure that will make treating the disease easier.\nVongspawn Template \nThe following rules apply to any character or creature that becomes a Vongspawn: \n• The persistent condition of the disease (see above) cannot be removed until the disease is cured. \n• Spiky growths appear on the vongspawn's body. The Vongspawn is unable to wear normal armor until cured. \n• When a Vongspawn hits a target with an unarmed attack, the vongspawn makes a secondary attack (1d20+10) against the target's Fortitude Defense. If this attack hits, the target becomes infected with the disease.",
        "modifications_summary_text": null,
        "structured_modifications": []
      },
      {
        "id": "yuuzhan_vong_biotech_general_gear_l",
        "name": "Yuuzhan Vong Biotech",
        "source_book": "L",
        "page": 66,
        "applies_to_type": "General Gear",
        "availability_modification": {
          "text_original": "Rare. Illegal in Legacy Era.",
          "set_to": "Rare. Illegal in Legacy Era.",
          "adds_traits": []
        },
        "cost_modification": {
          "text_original": "x4",
          "options": [
            {
              "type": "base_item_multiplier",
              "value": 4.0
            }
          ],
          "selection_logic": null
        },
        "full_text_description": null,
        "modifications_summary_text": "Armor weight /2 and is repaired with treat injury skill.\nUse of equipment & weapons get -5 penalty if lacking knowledge.\nEnergy DMG is changed to either bludgeoning, slashing or slashing.",
        "structured_modifications": [
          {
            "text_description": "Armor weight /2 and is repaired with treat injury skill.\nUse of equipment & weapons get -5 penalty if lacking knowledge.\nEnergy DMG is changed to either bludgeoning, slashing or slashing.",
            "target_stat": "Unknown",
            "change_type": "text_rule"
          }
        ]
      }
    ]
  }
}